local data = {
  extensions = {
    additional = {
      title = "Lettres supplémentaires",
      entries = { { "Ɑ", "ɑ" }, { "Ꞛ", "ꞛ" }, { "Ꞵ", "ꞵ" }, { "Ꝯ", "ꝯ" }, { "Ð", "ð" }, { "Ɖ", "ɖ" }, { "Ꝺ", "ꝺ" }, { "ẟ" }, { "Ə", "ə" }, { "Ɛ", "ɛ" }, { "Ꝫ", "ꝫ" }, { "ꭡ" }, { "Ⅎ", "ⅎ" }, { "Ꝼ", "ꝼ" }, { "ɸ" }, { "ⱷ" }, { "Ɣ", "ɣ" }, { "Ᵹ", "ᵹ" }, { "Ƣ", "ƣ" }, { "Ꜧ", "ꜧ" }, { "Ƕ", "ƕ" }, { "Ⱶ", "ⱶ" }, { "Ɩ", "ɩ" }, { "Kʼ", "ĸ" }, { "ƛ" }, { "Ŋ", "ŋ" }, { "ᴖ" }, { "ᴗ" }, { "Ɔ", "ɔ" }, { "Ꞷ", "ꞷ" }, { "ꭥ" }, { "Ꞝ", "ꞝ" }, { "Ȣ", "ȣ" }, { "Ꝛ", "ꝛ" }, { "Ʀ", "ʀ" }, { "Ꞃ", "ꞃ" }, { "Ꝝ", "ꝝ" }, { "ꭅ" }, { "Ꞅ", "ꞅ" }, { "Ʃ", "ʃ" }, { "Ꝭ", "ꝭ" }, { "ẞ", "ß" }, { "Ꞇ", "ꞇ" }, { "Þ", "þ" }, { "ꭐ" }, { "Ʊ", "ʊ" }, { "Ꞟ", "ꞟ" }, { "ꝸ" }, { "Ʋ", "ʋ" }, { "Ỽ", "ỽ" }, { "Ꝩ", "ꝩ" }, { "Ƿ", "ƿ" }, { "Ꭓ", "ꭓ" }, { "Ȝ", "ȝ" }, { "Ꝣ", "ꝣ" }, { "Ʒ", "ʒ" }, { "Ꜫ", "ꜫ" }, { "Ꜭ", "ꜭ" }, { "Ꜯ", "ꜯ" }, { "Ƨ", "ƨ" }, { "Ƽ", "ƽ" }, { "Ɂ", "ɂ" }, { "ǀ" }, { "ǁ" }, { "ǂ" }, { "ǃ" }, { "ʘ" }, { "Ꜣ", "ꜣ" }, { "Ꜥ", "ꜥ" }, },
    },
  },
  letters = {
    ["Ɑ"] = {
      diacritics = { { "Ɑ́", "ɑ́" }, { "Ɑ̀", "ɑ̀" }, { "Ɑ̂", "ɑ̂" }, { "Ɑ̌", "ɑ̌" }, { "ꬰ" }, { "ᶐ" }, },
      variants = { { "ᵅ" }, { "Ɒ", "ɒ" }, { "ᶛ" }, { "ꭤ" }, },
    },
    ["Ꝯ"] = {
      variants = { { "ꝰ" }, },
    },
    ["Ð"] = {
      diacritics = { { "Ð̣", "ð̣" }, },
      variants = { { "ᶞ" }, },
    },
    ["Ꝺ"] = {
      diacritics = { { "Ꝺ́", "ꝺ́" }, { "Ꝺ̇", "ꝺ̇" }, },
    },
    ["ẟ"] = {
      variants = { { "ƍ" }, },
    },
    ["Ə"] = {
      diacritics = { { "Ə́", "ə́" }, { "Ə̀", "ə̀" }, { "Ə̂", "ə̂" }, { "Ə̈", "ə̈" }, { "Ə̧", "ə̧" }, { "Ə̃", "ə̃" }, { "Ə̄", "ə̄" }, { "Ə̌", "ə̌" }, { "Ə̣", "ə̣" }, { "Ə̧́", "ə̧́" }, { "Ə̣́", "ə̣́" }, { "Ə̧̀", "ə̧̀" }, { "Ə̣̀", "ə̣̀" }, },
      variants = { { "ꬱ" }, { "ꭀ" }, },
    },
    ["Ɛ"] = {
      diacritics = { { "Ɛ́", "ɛ́" }, { "Ɛ̀", "ɛ̀" }, { "Ɛ̂", "ɛ̂" }, { "Ɛ̈", "ɛ̈" }, { "Ɛ̧", "ɛ̧" }, { "Ɛ̃", "ɛ̃" }, { "Ɛ̄", "ɛ̄" }, { "Ɛ̌", "ɛ̌" }, { "Ɛ̣", "ɛ̣" }, { "Ɛ̍", "ɛ̍" }, { "Ɛ̨", "ɛ̨" }, { "Ɛ̰", "ɛ̰" }, { "Ɛ̱", "ɛ̱" }, { "Ɛ᷆", "ɛ᷆" }, { "Ɛ᷇", "ɛ᷇" }, { "Ɛ̧́", "ɛ̧́" }, { "Ɛ̨́", "ɛ̨́" }, { "Ɛ̰́", "ɛ̰́" }, { "Ɛ̰̀", "ɛ̰̀" }, { "Ɛ̧̂", "ɛ̧̂" }, { "Ɛ̃́", "ɛ̃́" }, { "Ɛ̃̀", "ɛ̃̀" }, { "Ɛ̃̂", "ɛ̃̂" }, { "Ɛ̱̈", "ɛ̱̈" }, { "Ɛ̃̌", "ɛ̃̌" }, { "Ɛ̃̍", "ɛ̃̍" }, { "Ɛ̰̄", "ɛ̰̄" }, },
      variants = { { "Ɜ", "ɜ" }, { "ᴈ" }, { "ɞ" }, },
    },
    ["Ɣ"] = {
      diacritics = { { "Ɣ̌", "ɣ̌" }, { "Ɣ̓", "ɣ̓" }, },
    },
    ["Ᵹ"] = {
      variants = { { "Ꝿ", "ꝿ" }, },
    },
    ["Ɩ"] = {
      diacritics = { { "Ɩ́", "ɩ́" }, { "Ɩ̀", "ɩ̀" }, { "Ɩ̃", "ɩ̃" }, { "Ɩ̃́", "ɩ̃́" }, { "Ɩ̃̀", "ɩ̃̀" }, },
    },
    ["ƛ"] = {
      diacritics = { { "ƛ̓" }, },
    },
    ["Ŋ"] = {
      diacritics = { { "Ŋ́", "ŋ́" }, { "Ŋ̀", "ŋ̀" }, { "Ŋ̂", "ŋ̂" }, { "Ŋ̈", "ŋ̈" }, { "Ŋ̄", "ŋ̄" }, { "ꬼ" }, },
    },
    ["Ɔ"] = {
      diacritics = { { "Ɔ́", "ɔ́" }, { "Ɔ̀", "ɔ̀" }, { "Ɔ̂", "ɔ̂" }, { "Ɔ̈", "ɔ̈" }, { "Ɔ̧", "ɔ̧" }, { "Ɔ̃", "ɔ̃" }, { "Ɔ̄", "ɔ̄" }, { "Ɔ̍", "ɔ̍" }, { "Ɔ̌", "ɔ̌" }, { "Ɔ̣", "ɔ̣" }, { "Ɔ̨", "ɔ̨" }, { "Ɔ̰", "ɔ̰" }, { "Ɔ̱", "ɔ̱" }, { "Ɔ᷆", "ɔ᷆" }, { "Ɔ᷇", "ɔ᷇" }, { "Ɔ̧́", "ɔ̧́" }, { "Ɔ̰́", "ɔ̰́" }, { "Ɔ̧̀", "ɔ̧̀" }, { "Ɔ̧̂", "ɔ̧̂" }, { "Ɔ̃́", "ɔ̃́" }, { "Ɔ̃̀", "ɔ̃̀" }, { "Ɔ̃̂", "ɔ̃̂" }, { "Ɔ̃̌", "ɔ̃̌" }, { "Ɔ̃̍", "ɔ̃̍" }, { "Ɔ̰̄", "ɔ̰̄" }, { "Ɔ̧̌", "ɔ̧̌" }, },
      variants = { { "ᴐ" }, { "ꬿ" }, { "ᴒ" }, },
    },
    ["Ꞷ"] = {
      variants = { { "ɷ" }, },
    },
    ["Ȣ"] = {
      variants = { { "ᴕ" }, },
    },
    ["Ꝝ"] = {
      variants = { { "ꝶ" }, },
    },
    ["Ʃ"] = {
      diacritics = { { "ʆ" }, },
      variants = { { "ꭍ" }, { "ƪ" }, },
    },
    ["Þ"] = {
      diacritics = { { "Ꝥ", "ꝥ" }, { "Ꝧ", "ꝧ" }, },
    },
    ["ꭐ"] = {
      variants = { { "ꭑ" }, },
    },
    ["Ʊ"] = {
      diacritics = { { "Ʊ́", "ʊ́" }, { "Ʊ̀", "ʊ̀" }, },
      variants = { { "ᵿ" }, },
    },
    ["Ʋ"] = {
      diacritics = { { "Ʋ́", "ʋ́" }, { "Ʋ̀", "ʋ̀" }, { "Ʋ̈", "ʋ̈" }, { "Ʋ̃", "ʋ̃" }, { "Ʋ̃́", "ʋ̃́" }, { "Ʋ̃̀", "ʋ̃̀" }, },
    },
    ["Ꭓ"] = {
      diacritics = { { "ꭔ" }, { "ꭕ" }, },
    },
    ["Ʒ"] = {
      diacritics = { { "Ǯ", "ǯ" }, { "ʓ" }, { "ƺ" }, { "𝼘" }, },
      variants = { { "ᴣ" }, { "Ƹ", "ƹ" }, },
    },
    ["Ɂ"] = {
      variants = { { "ʔ" }, { "ʖ" }, { "ʕ" }, { "ʕ̓" }, { "Ꞌ", "ꞌ" }, { "ʻ" }, { "ʼ" }, },
    },
    ------------------------
    ["A"] = {
      diacritics = { { "A", "a" }, { "Á", "á" }, { "À", "à" }, { "Â", "â" }, { "Ä", "ä" }, { "A̧", "a̧" }, { "Ã", "ã" }, { "Ā", "ā" }, { "Ă", "ă" }, { "Ȧ", "ȧ" }, { "Ả", "ả" }, { "Å", "å" }, { "A̋", "a̋" }, { "Ǎ", "ǎ" }, { "A̍", "a̍" }, { "Ȁ", "ȁ" }, { "A̐", "a̐" }, { "Ȃ", "ȃ" }, { "A̓", "a̓" }, { "Ạ", "ạ" }, { "A̤", "a̤" }, { "Ḁ", "ḁ" }, { "Ą", "ą" }, { "A̭", "a̭" }, { "A̰", "a̰" }, { "A̱", "a̱" }, { "A̲", "a̲" }, { "A᷎", "a᷎" }, { "Ⱥ", "ⱥ" }, { "ᶏ" }, { "Á̧", "á̧" }, { "Ạ́", "ạ́" }, { "Á̤", "á̤" }, { "Ą́", "ą́" }, { "Á̱", "á̱" }, { "À̧", "à̧" }, { "Ạ̀", "ạ̀" }, { "À̤", "à̤" }, { "Ą̀", "ą̀" }, { "À̱", "à̱" }, { "Ấ", "ấ" }, { "Ầ", "ầ" }, { "Â̧", "â̧" }, { "Ẫ", "ẫ" }, { "Ẩ", "ẩ" }, { "Ậ", "ậ" }, { "Â̤", "â̤" }, { "Ą̂", "ą̂" }, { "Â̱", "â̱" }, { "Ä́", "ä́" }, { "Ä̀", "ä̀" }, { "Ä̂", "ä̂" }, { "Ä̃", "ä̃" }, { "Ǟ", "ǟ" }, { "Ä̌", "ä̌" }, { "Ạ̈", "ạ̈" }, { "Ą̈", "ą̈" }, { "Ä̱", "ä̱" }, { "Ã́", "ã́" }, { "Ã̀", "ã̀" }, { "Ã̂", "ã̂" }, { "Ã̌", "ã̌" }, { "Ã̍", "ã̍" }, { "Ạ̃", "ạ̃" }, { "Ą̃", "ą̃" }, { "Ā́", "ā́" }, { "Ā̀", "ā̀" }, { "Ā̂", "ā̂" }, { "Ā̆", "ā̆" }, { "Ā̊", "ā̊" }, { "Ā̌", "ā̌" }, { "Ạ̄", "ạ̄" }, { "Ā̤", "ā̤" }, { "Ą̄", "ą̄" }, { "Ā̱", "ā̱" }, { "Ắ", "ắ" }, { "Ằ", "ằ" }, { "Ẵ", "ẵ" }, { "Ẳ", "ẳ" }, { "Ặ", "ặ" }, { "Ă̤", "ă̤" }, { "Ǻ", "ǻ" }, { "Å̂", "å̂" }, { "Ą̊", "ą̊" }, { "Å̱", "å̱" }, { "Ǎ̧", "ǎ̧" }, { "Ą̌", "ą̌" }, { "A̤̍", "a̤̍" }, { "Ȧ́", "ȧ́" }, { "Ǡ", "ǡ" }, { "Ą̈̀", "ą̈̀" }, { "Ą̈̂", "ą̈̂" }, { "Ą̈̌", "ą̈̌" }, { "Ą̄́", "ą̄́" }, { "Ā̱́", "ā̱́" }, { "Ą̄̀", "ą̄̀" }, { "Ā̱̀", "ā̱̀" }, { "Ą̄̂", "ą̄̂" }, { "Ā̱̂", "ā̱̂" }, { "Ą̄̌", "ą̄̌" }, },
      variants = { { "ᴬ", "ᵃ" }, { "ª" }, { "ᴀ" }, { "Ɐ", "ɐ" }, { "ᵄ" }, { "Ꜳ", "ꜳ" }, { "Ꜳ́", "ꜳ́" }, { "Ꜳ̈", "ꜳ̈" }, { "Ꜳ̇", "ꜳ̇" }, { "Ꜳ̋", "ꜳ̋" }, { "Ꜳ̣", "ꜳ̣" }, { "Æ", "æ" }, { "Ǽ", "ǽ" }, { "Æ̀", "æ̀" }, { "Æ̂", "æ̂" }, { "Æ̈", "æ̈" }, { "Æ̃", "æ̃" }, { "Ǣ", "ǣ" }, { "Æ̆", "æ̆" }, { "Æ̇", "æ̇" }, { "Æ̊", "æ̊" }, { "Æ̋", "æ̋" }, { "Æ̣", "æ̣" }, { "Æ̨", "æ̨" }, { "Ǽ̨", "ǽ̨" }, { "Ǣ́", "ǣ́" }, { "Ǣ̆", "ǣ̆" }, { "ᴁ" }, { "ᴂ" }, { "ᴭ" }, { "ᵆ" }, { "ꬱ" }, { "Ꜵ", "ꜵ" }, { "Ꜵ́", "ꜵ́" }, { "Ꜵ̋", "ꜵ̋" }, { "Ꜵ̣", "ꜵ̣" }, { "Ꜷ", "ꜷ" }, { "Ꜷ́", "ꜷ́" }, { "Ꜷ̣", "ꜷ̣" }, { "Ꜹ", "ꜹ" }, { "Ꜹ́", "ꜹ́" }, { "Ꜹ̋", "ꜹ̋" }, { "Ꜹ̣", "ꜹ̣" }, { "Ꜹ̨", "ꜹ̨" }, { "Ꜻ", "ꜻ" }, { "Ꜽ", "ꜽ" }, { "Ꜽ̇", "ꜽ̇" }, { "Ꜽ̣", "ꜽ̣" }, },
    },
    ["B"] = {
      diacritics = { { "B́", "b́" }, { "B̀", "b̀" }, { "B̃", "b̃" }, { "B̄", "b̄" }, { "Ḃ", "ḃ" }, { "Ḅ", "ḅ" }, { "B̤", "b̤" }, { "B̓", "b̓" }, { "B̦", "b̦" }, { "Ḇ", "ḇ" }, { "Ƀ", "ƀ" }, { "Ɓ", "ɓ" }, { "Ꞗ", "ꞗ" }, { "ᶀ" }, { "ᵬ" }, },
      variants = { { "ʙ" }, { "ᴃ" }, { "Ƃ", "ƃ" }, { "ȸ" }, },
    },
    ["C"] = {
      diacritics = { { "Ć", "ć" }, { "C̀", "c̀" }, { "Ĉ", "ĉ" }, { "C̈", "c̈" }, { "Ç", "ç" }, { "C̃", "c̃" }, { "C̄", "c̄" }, { "C̆", "c̆" }, { "Ċ", "ċ" }, { "C̋", "c̋" }, { "Č", "č" }, { "C̓", "c̓" }, { "C̣", "c̣" }, { "C̦", "c̦" }, { "C̱", "c̱" }, { "Ȼ", "ȼ" }, { "Ꞓ", "ꞓ" }, { "Ƈ", "ƈ" }, { "ɕ" }, { "ꞔ" }, { "Ḉ", "ḉ" }, { "Ć̣", "ć̣" }, { "Ç̆", "ç̆" }, { "Ç̇", "ç̇" }, { "Ç̌", "ç̌" }, { "Č̈", "č̈" }, { "Č̣", "č̣" }, { "Č̓", "č̓" }, },
      variants = { { "ᴄ" }, { "Ↄ", "ↄ" }, { "Ꜿ", "ꜿ" }, { "ʗ" }, { "ʨ" }, },
    },
    ["D"] = {
      diacritics = { { "D́", "d́" }, { "D̂", "d̂" }, { "Ḑ", "ḑ" }, { "D̄", "d̄" }, { "Ḋ", "ḋ" }, { "Ď", "ď" }, { "D̓", "d̓" }, { "Ḍ", "ḍ" }, { "D̤", "d̤" }, { "D̦", "d̦" }, { "Ḓ", "ḓ" }, { "Ḏ", "ḏ" }, { "D̲", "d̲" }, { "Đ", "đ" }, { "Ɗ", "ɗ" }, { "ȡ" }, { "ᶁ" }, { "ᵭ" }, { "Ḍ̄", "ḍ̄" }, { "Ḏ̣", "ḏ̣" }, { "Đ̣", "đ̣" }, { "ᶑ" }, },
      variants = { { "ᴅ" }, { "ᴆ" }, { "Ƌ", "ƌ" }, { "ȸ" }, { "Ǳ", "ǲ", "ǳ" }, { "ʣ" }, { "Ǆ", "ǅ", "ǆ" }, { "ʥ" }, { "ʤ" }, },
    },
    ["E"] = {
      diacritics = { { "É", "é" }, { "È", "è" }, { "Ê", "ê" }, { "Ë", "ë" }, { "Ȩ", "ȩ" }, { "Ẽ", "ẽ" }, { "Ē", "ē" }, { "Ĕ", "ĕ" }, { "Ė", "ė" }, { "Ẻ", "ẻ" }, { "E̊", "e̊" }, { "E̋", "e̋" }, { "Ě", "ě" }, { "E̍", "e̍" }, { "Ȅ", "ȅ" }, { "Ȇ", "ȇ" }, { "E̛", "e̛" }, { "Ẹ", "ẹ" }, { "E̤", "e̤" }, { "Ę", "ę" }, { "Ḙ", "ḙ" }, { "Ḛ", "ḛ" }, { "E̱", "e̱" }, { "E̲", "e̲" }, { "E᷅", "e᷅" }, { "E᷆", "e᷆" }, { "E᷇", "e᷇" }, { "E᷎", "e᷎" }, { "Ɇ", "ɇ" }, { "ꬳ" }, { "ᶒ" }, { "ꬴ" }, { "ⱸ" }, { "Ȩ́", "ȩ́" }, { "É̈", "é̈" }, { "Ẹ́", "ẹ́" }, { "É̤", "é̤" }, { "Ę́", "ę́" }, { "É̱", "é̱" }, { "Ȩ̀", "ȩ̀" }, { "Ẹ̀", "ẹ̀" }, { "È̤", "è̤" }, { "Ę̀", "ę̀" }, { "È̱", "è̱" }, { "È̲", "è̲" }, { "Ế", "ế" }, { "Ề", "ề" }, { "Ȩ̂", "ȩ̂" }, { "Ễ", "ễ" }, { "Ê̄", "ê̄" }, { "Ê̆", "ê̆" }, { "Ể", "ể" }, { "Ê̌", "ê̌" }, { "Ệ", "ệ" }, { "Ê̤", "ê̤" }, { "Ę̂", "ę̂" }, { "Ê̱", "ê̱" }, { "Ë́", "ë́" }, { "Ë̀", "ë̀" }, { "Ë̂", "ë̂" }, { "Ë̃", "ë̃" }, { "Ë̌", "ë̌" }, { "Ę̈", "ę̈" }, { "Ë̱", "ë̱" }, { "Ẽ́", "ẽ́" }, { "Ẽ̀", "ẽ̀" }, { "Ẽ̂", "ẽ̂" }, { "Ẽ̌", "ẽ̌" }, { "Ẽ̍", "ẽ̍" }, { "Ẹ̃", "ẹ̃" }, { "Ę̃", "ę̃" }, { "Ḗ", "ḗ" }, { "Ḕ", "ḕ" }, { "Ē̂", "ē̂" }, { "Ē̆", "ē̆" }, { "Ē̌", "ē̌" }, { "Ẹ̄", "ẹ̄" }, { "Ē̤", "ē̤" }, { "Ę̄", "ę̄" }, { "Ē̱", "ē̱" }, { "Ḝ", "ḝ" }, { "Ĕ̤", "ĕ̤" }, { "Ė́", "ė́" }, { "Ė̃", "ė̃" }, { "Ė̄", "ė̄" }, { "Ę̇", "ę̇" }, { "Ę̋", "ę̋" }, { "Ȩ̌", "ȩ̌" }, { "Ę̌", "ę̌" }, { "Ẹ̌", "ẹ̌" }, { "E̤̍", "e̤̍" }, { "Ę̣", "ę̣" }, { "Ę᷎", "ę᷎" }, { "Ę̈̀", "ę̈̀" }, { "Ę̈̂", "ę̈̂" }, { "Ę̈̌", "ę̈̌" }, { "Ę̄́", "ę̄́" }, { "Ḗ̱", "ḗ̱" }, { "Ę̄̀", "ę̄̀" }, { "Ḕ̱", "ḕ̱" }, { "Ę̄̂", "ę̄̂" }, { "Ē̱̂", "ē̱̂" }, { "Ę̄̌", "ę̄̌" }, },
      variants = { { "ᴇ" }, { "ⱻ" }, { "ꬲ" }, { "ɘ" }, { "Ǝ", "ǝ" }, { "Ǝ́", "ǝ́" }, { "Ǝ̀", "ǝ̀" }, { "Ǝ̂", "ǝ̂" }, { "Ǝ̃", "ǝ̃" }, { "Ǝ̄", "ǝ̄" }, { "Ǝ̌", "ǝ̌" }, { "Æ", "æ" }, { "Ǽ", "ǽ" }, { "Æ̀", "æ̀" }, { "Æ̂", "æ̂" }, { "Æ̈", "æ̈" }, { "Æ̃", "æ̃" }, { "Ǣ", "ǣ" }, { "Æ̆", "æ̆" }, { "Æ̇", "æ̇" }, { "Æ̊", "æ̊" }, { "Æ̋", "æ̋" }, { "Æ̣", "æ̣" }, { "Æ̨", "æ̨" }, { "Ǽ̨", "ǽ̨" }, { "Ǣ́", "ǣ́" }, { "Ǣ̆", "ǣ̆" }, { "ᴁ" }, { "ᴂ" }, { "ᴭ" }, { "ᵆ" }, { "&" }, { "Œ", "œ" }, { "Œ́", "œ́" }, { "Œ̀", "œ̀" }, { "Œ̂", "œ̂" }, { "Œ̈", "œ̈" }, { "Œ̄", "œ̄" }, { "Œ̌", "œ̌" }, { "ɶ" }, { "ꭀ" }, { "ᴔ" }, { "ꭁ" }, { "ꭂ" }, { "ꭢ" }, { "ᵫ" }, },
    },
    ["F"] = {
      diacritics = { { "F́", "f́" }, { "F̀", "F̀" }, { "F̧", "f̧" }, { "F̄", "f̄" }, { "Ḟ", "ḟ" }, { "Ꞙ", "ꞙ" }, { "ᶂ" }, { "Ƒ", "ƒ" }, { "ᵮ" }, },
      variants = { { "ꜰ" }, { "ꬵ" }, { "ﬀ" }, { "ﬁ" }, { "ﬂ" }, { "ﬃ" }, { "ﬄ" }, { "ʩ" }, },
    },
    ["G"] = {
      diacritics = { { "Ǵ", "ǵ" }, { "G̀", "g̀" }, { "Ĝ", "ĝ" }, { "G̈", "g̈" }, { "Ģ", "ģ" }, { "G̃", "g̃" }, { "Ḡ", "ḡ" }, { "Ğ", "ğ" }, { "Ġ", "ġ" }, { "Ǧ", "ǧ" }, { "G̣", "g̣" }, { "G̤", "g̤" }, { "G̦", "g̦" }, { "Ꞡ", "ꞡ" }, { "Ǥ", "ǥ" }, { "Ɠ", "ɠ" }, { "ᶃ" }, { "ꬶ" }, { "Ǧ̈", "ǧ̈" }, },
      variants = { { "ɢ" }, { "ʛ" }, { "Ɡ", "ɡ" }, { "ᵷ" }, },
    },
    ["H"] = {
      diacritics = { { "H́", "h́" }, { "Ĥ", "ĥ" }, { "Ḩ", "ḩ" }, { "Ḧ", "ḧ" }, { "H̄", "h̄" }, { "Ḣ", "ḣ" }, { "Ȟ", "ȟ" }, { "H̐", "h̐" }, { "H̓", "h̓" }, { "Ḥ", "ḥ" }, { "H̤", "h̤" }, { "H̦", "h̦" }, { "Ḫ", "ḫ" }, { "H̱", "ẖ" }, { "Ħ", "ħ" }, { "Ⱨ", "ⱨ" }, { "Ɦ", "ɦ" }, },
      variants = { { "ʜ" }, { "Ɥ", "ɥ" }, { "ʮ" }, { "ʯ" }, { "ᵺ" }, },
    },
    ["I"] = {
      diacritics = { { "Í", "í" }, { "Ì", "ì" }, { "Î", "î" }, { "Ï", "ï" }, { "I̧", "i̧" }, { "Ĩ", "ĩ" }, { "Ī", "ī" }, { "Ĭ", "ĭ" }, { "İ", "i" }, { "Ỉ", "ỉ" }, { "I̊", "i̊" }, { "I̋", "i̋" }, { "Ǐ", "ǐ" }, { "I̍", "i̍" }, { "Ȉ", "ȉ" }, { "I̐", "i̐" }, { "Ȋ", "ȋ" }, { "I̓", "i̓" }, { "Ị", "ị" }, { "Į", "į" }, { "I̭", "i̭" }, { "Ḭ", "ḭ" }, { "I̱", "i̱" }, { "Ɨ", "ɨ" }, { "ᶖ" }, { "Í̧", "í̧" }, { "Ị́", "ị́" }, { "Į́", "į́", "į̇́" }, { "Í̱", "í̱" }, { "Ì̧", "ì̧" }, { "Į̀", "į̀" }, { "Ì̱", "ì̱" }, { "Î́", "î́" }, { "Î̧", "î̧" }, { "Ị̂", "ị̂" }, { "Į̂", "į̂" }, { "Î̱", "î̱" }, { "Ḯ", "ḯ" }, { "Ï̂", "ï̂" }, { "Ĩ́", "ĩ́" }, { "Ĩ̀", "ĩ̀" }, { "Ĩ̂", "ĩ̂" }, { "Ị̃", "ị̃" }, { "Ĩ̌", "ĩ̌" }, { "Ĩ̍", "ĩ̍" }, { "Į̃", "į̃", "į̇̃" }, { "Ī́", "ī́" }, { "Ī̀", "ī̀" }, { "Ī̂", "ī̂" }, { "Ī̱", "ī̱" }, { "Į̌", "į̌" }, { "Ɨ́", "ɨ́" }, { "Ɨ̀", "ɨ̀" }, { "Ɨ̂", "ɨ̂" }, { "Ɨ̈", "ɨ̈" }, { "Ɨ̧", "ɨ̧" }, { "Ɨ̃", "ɨ̃" }, { "Ɨ̄", "ɨ̄" }, { "Ɨ̌", "ɨ̌" }, { "Ī̱́", "ī̱́" }, { "Ī̱̀", "ī̱̀" }, { "Ī̱̂", "ī̱̂" }, { "Ɨ̧̀", "ɨ̧̀" }, { "Ɨ̧̂", "ɨ̧̂" }, { "Ɨ̧̌", "ɨ̧̌" }, },
      variants = { { "I", "ı" }, { "Ɪ", "ɪ" }, { "ᵻ" }, { "ᴉ" }, { "ꟾ" }, { "ꟷ" }, { "Ĳ", "ĳ" }, { "ﬁ" }, { "ﬃ" }, },
    },
    ["J"] = {
      diacritics = { { "J́", "j́" }, { "Ĵ", "ĵ" }, { "J̈", "j̈" }, { "J̧", "j̧" }, { "J̃", "j̃", "j̇̃" }, { "J̄", "j̄" }, { "J̇", "j" }, { "J̌", "ǰ" }, { "J̣", "j̣" }, { "Ɉ", "ɉ" }, { "Ʝ", "ʝ" }, { "J̣̌", "ǰ̣" }, },
      variants = { { "ᴊ" }, { "J", "ȷ" }, { "ɟ" }, { "ʄ" }, { "Ĳ", "ĳ" }, { "Ǉ", "ǈ", "ǉ" }, { "Ǌ", "ǋ", "ǌ" }, },
    },
    ["K"] = {
      diacritics = { { "Ḱ", "ḱ" }, { "K̀", "k̀" }, { "K̈", "k̈" }, { "Ķ", "ķ" }, { "K̄", "k̄" }, { "K̇", "k̇" }, { "Ǩ", "ǩ" }, { "Ḳ", "ḳ" }, { "K̤", "k̤" }, { "K̦", "k̦" }, { "Ḵ", "ḵ" }, { "Ⱪ", "ⱪ" }, { "Ƙ", "ƙ" }, { "Ꝃ", "ꝃ" }, { "Ꞣ", "ꞣ" }, { "Ꝁ", "ꝁ" }, { "ᶄ" }, { "Ḵ̓", "ḵ̓" }, { "Ꝅ", "ꝅ" }, },
      variants = { { "ᴋ" }, { "Ʞ", "ʞ" }, },
    },
    ["L"] = {
      diacritics = { { "Ĺ", "ĺ" }, { "L̀", "l̀" }, { "L̂", "l̂" }, { "L̈", "l̈" }, { "Ļ", "ļ" }, { "L̃", "l̃" }, { "L̄", "l̄" }, { "L̇", "l̇" }, { "Ľ", "ľ" }, { "L̐", "l̐" }, { "L̓", "l̓" }, { "Ḷ", "ḷ" }, { "L̤", "l̤" }, { "L̥", "l̥" }, { "L̦", "l̦" }, { "Ḽ", "ḽ" }, { "L̮", "l̮" }, { "Ḻ", "ḻ" }, { "Ł", "ł" }, { "Ƚ", "ƚ" }, { "Ꝉ", "ꝉ" }, { "Ⱡ", "ⱡ" }, { "ȴ" }, { "Ɬ", "ɬ" }, { "ɭ" }, { "ᶅ" }, { "Ɫ", "ɫ" }, { "ꬸ" }, { "ꬹ" }, { "Ŀ", "ŀ" }, { "L᷊", "l᷊" }, { "ꬷ" }, { "Ḷ́", "ḷ́" }, { "Ĺ̥", "ĺ̥" }, { "Ḷ̀", "ḷ̀" }, { "L̥̀", "l̥̀" }, { "L̤̄", "l̤̄" }, { "Ḹ", "ḹ" }, { "L̥̄", "l̥̄" }, { "L̮̄", "l̮̄" }, { "Ḷ̓", "ḷ̓" }, { "Ł̣", "ł̣" }, },
      variants = { { "ʟ" }, { "ᴌ" }, { "Ꞁ", "ꞁ" }, { "Ꝇ", "ꝇ" }, { "ﬂ" }, { "ﬄ" }, { "Ǉ", "ǈ", "ǉ" }, { "Ỻ", "ỻ" }, { "ʪ" }, { "ʫ" }, { "ɮ" }, },
    },
    ["M"] = {
      diacritics = { { "Ḿ", "ḿ" }, { "M̀", "m̀" }, { "M̂", "m̂" }, { "M̈", "m̈" }, { "M̧", "m̧" }, { "M̃", "m̃" }, { "M̄", "m̄" }, { "Ṁ", "ṁ" }, { "M̌", "m̌" }, { "M̍", "m̍" }, { "M̐", "m̐" }, { "Ṃ", "ṃ" }, { "M̦", "m̦" }, { "M̨", "m̨" }, { "M̭", "m̭" }, { "M̱", "m̱" }, { "ꬺ" }, { "ᶆ" }, { "Ɱ", "ɱ" }, { "ᵯ" }, { "Ṃ́", "ṃ́" }, { "Ṃ̓", "ṃ̓" }, },
      variants = { { "ᴍ" }, { "Ɯ", "ɯ" }, { "Ɯ̃", "ɯ̃" }, { "ꟺ" }, { "ɰ" }, { "ᴟ" }, { "ꟽ" }, { "ꟿ" }, },
    },
    ["N"] = {
      diacritics = { { "Ń", "ń" }, { "Ǹ", "ǹ" }, { "N̂", "n̂" }, { "N̈", "n̈" }, { "Ņ", "ņ" }, { "Ñ", "ñ" }, { "N̄", "n̄" }, { "N̆", "n̆" }, { "Ṅ", "ṅ" }, { "Ň", "ň" }, { "N̍", "n̍" }, { "N̐", "n̐" }, { "Ṇ", "ṇ" }, { "N̦", "n̦" }, { "Ṋ", "ṋ" }, { "N̰", "n̰" }, { "Ṉ", "ṉ" }, { "N̲", "n̲" }, { "Ꞥ", "ꞥ" }, { "Ꞑ", "ꞑ" }, { "ȵ" }, { "ꬻ" }, { "ɳ" }, { "ᶇ" }, { "Ɲ", "ɲ" }, { "ᵰ" }, { "Ṇ́", "ṇ́" }, { "Ñ̈", "ñ̈" }, { "Ṇ̓", "ṇ̓" }, },
      variants = { { "ɴ" }, { "ᴎ" }, { "Ƞ", "ƞ" }, { "ŉ" }, { "Ǌ", "ǋ", "ǌ" }, },
    },
    ["O"] = {
      diacritics = { { "Ó", "ó" }, { "Ò", "ò" }, { "Ô", "ô" }, { "Ö", "ö" }, { "O̧", "o̧" }, { "Õ", "õ" }, { "Ō", "ō" }, { "Ŏ", "ŏ" }, { "Ȯ", "ȯ" }, { "Ỏ", "ỏ" }, { "O̊", "o̊" }, { "Ő", "ő" }, { "Ǒ", "ǒ" }, { "O̍", "o̍" }, { "Ȍ", "ȍ" }, { "O̐", "o̐" }, { "Ȏ", "ȏ" }, { "Ơ", "ơ" }, { "Ọ", "ọ" }, { "O̤", "o̤" }, { "Ǫ", "ǫ" }, { "O̭", "o̭" }, { "O̱", "o̱" }, { "O̲", "O̲" }, { "O͘", "o͘" }, { "Ø", "ø" }, { "Ɵ", "ɵ" }, { "Ꝋ", "ꝋ" }, { "Ꝍ", "ꝍ" }, { "Ó̧", "ó̧" }, { "Ọ́", "ọ́" }, { "Ó̤", "ó̤" }, { "Ǫ́", "ǫ́" }, { "Ó̱", "ó̱" }, { "Ó̲", "ó̲" }, { "Ò̧", "ò̧" }, { "Ọ̀", "ọ̀" }, { "Ò̤", "ò̤" }, { "Ǫ̀", "ǫ̀" }, { "Ò̱", "ò̱" }, { "Ò̲", "ò̲" }, { "Ố", "ố" }, { "Ồ", "ồ" }, { "Ô̧", "ô̧" }, { "Ỗ", "ỗ" }, { "Ô̆", "ô̆" }, { "Ổ", "ổ" }, { "Ộ", "ộ" }, { "Ô̤", "ô̤" }, { "Ǫ̂", "ǫ̂" }, { "Ô̱", "ô̱" }, { "Ö́", "ö́" }, { "Ö̀", "ö̀" }, { "Ȫ", "ȫ" }, { "Ö̱", "ö̱" }, { "Ṍ", "ṍ" }, { "Õ̀", "õ̀" }, { "Ṏ", "ṏ" }, { "Ȭ", "ȭ" }, { "Ọ̃", "ọ̃" }, { "Ṓ", "ṓ" }, { "Ṑ", "ṑ" }, { "Ō̂", "ō̂" }, { "Ō̆", "ō̆" }, { "Ō̌", "ō̌" }, { "Ọ̄", "ọ̄" }, { "Ō̤", "ō̤" }, { "Ǭ", "ǭ" }, { "Ō̱", "ō̱" }, { "Ŏ̤", "ŏ̤" }, { "Ȱ", "ȱ" }, { "Ǒ̧", "ǒ̧" }, { "Ǫ̌", "ǫ̌" }, { "Ớ", "ớ" }, { "Ờ", "ờ" }, { "Ỡ", "ỡ" }, { "Ơ̆", "ơ̆" }, { "Ở", "ở" }, { "Ợ", "ợ" }, { "O̤̍", "o̤̍" }, { "Ó͘", "ó͘" }, { "Ò͘", "ò͘" }, { "Ô͘", "ô͘" }, { "Ō͘", "ō͘" }, { "O̍͘", "O̍͘" }, { "Ǿ", "ǿ" }, { "Ø̀", "ø̀" }, { "Ø̂", "ø̂" }, { "Ø̃", "ø̃" }, { "Ø̄", "ø̄" }, { "Ø̌", "ø̌" }, { "Ø̨", "ø̨" }, { "Ɵ́", "ɵ́" }, { "Ɵ̀", "ɵ̀" }, { "Ɵ̂", "ɵ̂" }, { "Ǭ́", "ǭ́" }, { "Ṓ̱", "ṓ̱" }, { "Ǭ̀", "ǭ̀" }, { "Ṑ̱", "ṑ̱" }, { "Ō̱̂", "ō̱̂" }, { "Ǭ̂", "ǭ̂" }, },
      variants = { { "ᴏ" }, { "ⱺ" }, { "ᴑ" }, { "ᴓ" }, { "ꬽ" }, { "ꬾ" }, { "Ꜵ", "ꜵ" }, { "Ꜵ́", "ꜵ́" }, { "Ꜵ̋", "ꜵ̋" }, { "Ꜵ̣", "ꜵ̣" }, { "Œ", "œ" }, { "Œ́", "œ́" }, { "Œ̀", "œ̀" }, { "Œ̂", "œ̂" }, { "Œ̈", "œ̈" }, { "Œ̄", "œ̄" }, { "Œ̌", "œ̌" }, { "ɶ" }, { "ꭀ" }, { "ᴔ" }, { "ꭁ" }, { "ꭂ" }, { "ꭢ" }, { "ꭃ" }, { "ꭄ" }, { "Ꝏ", "ꝏ" }, { "Ȣ", "ȣ" }, { "ᴕ" }, { "ꭣ" }, },
    },
    ["P"] = {
      diacritics = { { "Ṕ", "ṕ" }, { "P̀", "p̀" }, { "P̈", "p̈" }, { "P̃", "p̃" }, { "P̄", "p̄" }, { "Ṗ", "ṗ" }, { "P̌", "p̌" }, { "P̓", "p̓" }, { "P̔", "p̔" }, { "P̣", "p̣" }, { "P̤", "p̤" }, { "P̦", "p̦" }, { "P̱", "p̱" }, { "Ᵽ", "ᵽ" }, { "Ꝑ", "ꝑ" }, { "Ꝓ", "ꝓ" }, { "Ꝕ", "ꝕ" }, { "Ƥ", "ƥ" }, { "ᶈ" }, { "ᵱ" }, },
      variants = { { "ᴘ" }, { "ꟼ" }, { "ȹ" }, },
    },
    ["Q"] = {
      diacritics = { { "Q́", "q́" }, { "Q̈", "q̈" }, { "Q̃", "q̃" }, { "Q̄", "q̄" }, { "Q̊", "q̊" }, { "Q̇", "q̇" }, { "Q̌", "q̌" }, { "Q̣", "q̣" }, { "Q̱", "q̱" }, { "Ꝙ", "ꝙ" }, { "Ꝗ", "ꝗ" }, { "ʠ" }, { "Ɋ", "ɋ" }, },
      variants = { { "ȹ" }, },
    },
    ["R"] = {
      diacritics = { { "Ŕ", "ŕ" }, { "R̀", "r̀" }, { "R̂", "r̂" }, { "Ŗ", "ŗ" }, { "R̃", "r̃" }, { "R̄", "r̄" }, { "Ṙ", "ṙ" }, { "Ř", "ř" }, { "Ȑ", "ȑ" }, { "Ȓ", "ȓ" }, { "Ṛ", "ṛ" }, { "R̤", "r̤" }, { "R̥", "r̥" }, { "R̦", "r̦" }, { "R̮", "r̮" }, { "R̰", "r̰" }, { "Ṟ", "ṟ" }, { "Ꞧ", "ꞧ" }, { "Ɍ", "ɍ" }, { "Ɽ", "ɽ" }, { "ᶉ" }, { "ᵲ" }, { "Ṛ́", "ṛ́" }, { "Ŕ̥", "ŕ̥" }, { "Ṛ̀", "ṛ̀" }, { "R̥̀", "r̥̀" }, { "Ṝ", "ṝ" }, { "R̥̄", "r̥̄" }, { "R̮̄", "r̮̄" }, },
      variants = { { "Ʀ", "ʀ" }, { "ʁ" }, { "ᴙ" }, { "ᴚ" }, { "ꭆ" }, { "℟" }, { "ꭇ" }, { "ꭈ" }, { "ꭉ" }, { "ꭊ" }, { "ɼ" }, { "ɾ" }, { "ᵳ" }, { "ɿ" }, { "ʅ" }, { "ꭋ" }, { "ꭌ" }, { "ʳ" }, },
    },
    ["S"] = {
      diacritics = { { "Ś", "ś" }, { "S̀", "s̀" }, { "Ŝ", "ŝ" }, { "S̈", "s̈" }, { "Ş", "ş" }, { "S̄", "s̄" }, { "Ṡ", "ṡ" }, { "S̊", "s̊" }, { "Š", "š" }, { "S̓", "s̓" }, { "Ṣ", "ṣ" }, { "S̤", "s̤" }, { "Ș", "ș" }, { "S̭", "s̭" }, { "S̱", "s̱" }, { "Ꞩ", "ꞩ" }, { "Ȿ", "ȿ" }, { "Ʂ", "ʂ" }, { "ᶊ" }, { "ᵴ" }, { "Ṥ", "ṥ" }, { "Ṣ́", "ṣ́" }, { "Ş̄", "ş̄" }, { "Ṣ̄", "ṣ̄" }, { "Ṩ", "ṩ" }, { "Š́", "š́" }, { "Ṧ", "ṧ" }, { "Ṣ̌", "ṣ̌" }, { "Š̤", "š̤" }, { "Ṣ̤", "ṣ̤" }, },
      variants = { { "ꜱ" }, { "S", "ſ" }, { "Ṡ", "ẛ" }, { "Ꞩ", "ẜ" }, { "ẝ" }, { "ẞ", "ß" }, { "ﬆ" }, { "ﬅ" }, { "ʦ" }, },
    },
    ["T"] = {
      diacritics = { { "T́", "t́" }, { "T̀", "t̀" }, { "T̈", "ẗ" }, { "Ţ", "ţ" }, { "T̃", "t̃" }, { "T̄", "t̄" }, { "Ṫ", "ṫ" }, { "Ť", "ť" }, { "T̓", "t̓" }, { "Ṭ", "ṭ" }, { "T̤", "t̤" }, { "Ț", "ț" }, { "Ṱ", "ṱ" }, { "T̯", "t̯" }, { "T̰", "t̰" }, { "Ṯ", "ṯ" }, { "T̲", "t̲" }, { "Ⱦ", "ⱦ" }, { "Ŧ", "ŧ" }, { "Ƭ", "ƭ" }, { "Ʈ", "ʈ" }, { "ȶ" }, { "ƫ" }, { "ᵵ" }, { "Ṭ́", "ṭ́" }, { "Ṭ̤", "ṭ̤" }, { "Ṯ̣", "ṯ̣" }, },
      variants = { { "ᴛ" }, { "Ʇ", "ʇ" }, { "&" }, { "ﬆ" }, { "ﬅ" }, { "ʨ" }, { "ᵺ" }, { "ʦ" }, { "ƾ" }, { "Ꜩ", "ꜩ" }, { "ʧ" }, },
    },
    ["U"] = {
      diacritics = { { "Ú", "ú" }, { "Ù", "ù" }, { "Û", "û" }, { "Ü", "ü" }, { "U̧", "u̧" }, { "Ũ", "ũ" }, { "Ū", "ū" }, { "Ŭ", "ŭ" }, { "U̇", "u̇" }, { "Ủ", "ủ" }, { "Ů", "ů" }, { "Ű", "ű" }, { "Ǔ", "ǔ" }, { "U̍", "u̍" }, { "Ȕ", "ȕ" }, { "U̐", "u̐" }, { "Ȗ", "ȗ" }, { "U̓", "u̓" }, { "Ư", "ư" }, { "Ụ", "ụ" }, { "Ṳ", "ṳ" }, { "Ų", "ų" }, { "Ṷ", "ṷ" }, { "Ṵ", "ṵ" }, { "U̱", "u̱" }, { "U̲", "u̲" }, { "U᷆", "u᷆" }, { "U᷇", "u᷇" }, { "Ꞹ", "ꞹ" }, { "Ʉ", "ʉ" }, { "ꭒ" }, { "ᶙ" }, { "Ú̧", "ú̧" }, { "Ụ́", "ụ́" }, { "Ṳ́", "ṳ́" }, { "Ų́", "ų́" }, { "Ṵ́", "ṵ́" }, { "Ú̱", "ú̱" }, { "Ú̲", "ú̲" }, { "Ù̧", "ù̧" }, { "Ụ̀", "ụ̀" }, { "Ṳ̀", "ṳ̀" }, { "Ų̀", "ų̀" }, { "Ṵ̀", "ṵ̀" }, { "Ù̱", "ù̱" }, { "Û́", "û́" }, { "Û̧", "û̧" }, { "Ụ̂", "ụ̂" }, { "Ṳ̂", "ṳ̂" }, { "Ų̂", "ų̂" }, { "Û̱", "û̱" }, { "Ǘ", "ǘ" }, { "Ǜ", "ǜ" }, { "Ü̂", "ü̂" }, { "Ü̃", "ü̃" }, { "Ǖ", "ǖ" }, { "Ǚ", "ǚ" }, { "Ų̈", "ų̈" }, { "Ṹ", "ṹ" }, { "Ũ̀", "ũ̀" }, { "Ũ̂", "ũ̂" }, { "Ũ̌", "ũ̌" }, { "Ũ̍", "ũ̍" }, { "Ụ̃", "ụ̃" }, { "Ų̃", "ų̃" }, { "Ū́", "ū́" }, { "Ū̀", "ū̀" }, { "Ū̂", "ū̂" }, { "Ṻ", "ṻ" }, { "Ū̃", "ū̃" }, { "Ū̌", "ū̌" }, { "Ụ̄", "ụ̄" }, { "Ṳ̄", "ṳ̄" }, { "Ų̄", "ų̄" }, { "Ṵ̄", "ṵ̄" }, { "Ū̱", "ū̱" }, { "Ṳ̆", "ṳ̆" }, { "Ṳ̊", "ṳ̊" }, { "Ǔ̧", "ǔ̧" }, { "Ų̌", "ų̌" }, { "Ṳ̍", "ṳ̍" }, { "Ứ", "ứ" }, { "Ừ", "ừ" }, { "Ữ", "ữ" }, { "Ư̄", "ư̄" }, { "Ư̆", "ư̆" }, { "Ử", "ử" }, { "Ự", "ự" }, { "Ʉ́", "ʉ́" }, { "Ʉ̀", "ʉ̀" }, { "Ʉ̂", "ʉ̂" }, { "Ʉ̈", "ʉ̈" }, { "Ʉ̃", "ʉ̃" }, { "Ʉ̄", "ʉ̄" }, { "Ʉ̌", "ʉ̌" }, { "Ų̄́", "ų̄́" }, { "Ū̱́", "ū̱́" }, { "Ų̄̀", "ų̄̀" }, { "Ū̱̀", "ū̱̀" }, { "Ų̄̂", "ų̄̂" }, { "Ū̱̂", "ū̱̂" }, { "Ų̄̌", "ų̄̌" }, { "Ʉ̃́", "ʉ̃́" }, },
      variants = { { "ᴜ" }, { "ᵾ" }, { "ᴝ" }, { "ᴞ" }, { "ꭎ" }, { "ꭏ" }, { "Ꜷ", "ꜷ" }, { "Ꜷ́", "ꜷ́" }, { "Ꜷ̣", "ꜷ̣" }, { "Ȣ", "ȣ" }, { "ᴕ" }, { "ᵫ" }, { "ꭣ" }, { "Ɯ", "ɯ" }, { "Ɯ̃", "ɯ̃" }, },
    },
    ["V"] = {
      diacritics = { { "V́", "v́" }, { "V̀", "v̀" }, { "V̈", "v̈" }, { "Ṽ", "ṽ" }, { "V̄", "v̄" }, { "V̌", "v̌" }, { "V̐", "v̐" }, { "V̓", "v̓" }, { "Ṿ", "ṿ" }, { "V̦", "v̦" }, { "V̱", "v̱" }, { "Ꝟ", "ꝟ" }, { "ⱱ" }, { "ⱴ" }, { "ᶌ" }, },
      variants = { { "ᴠ" }, { "Ʌ", "ʌ" }, { "Ʌ́", "ʌ́" }, { "Ʌ̀", "ʌ̀" }, { "Ʌ̂", "ʌ̂" }, { "Ʌ̈", "ʌ̈" }, { "Ʌ̃", "ʌ̃" }, { "Ʌ̌", "ʌ̌" }, { "Ʌ̲", "ʌ̲" }, { "℣" }, { "Ꜹ", "ꜹ" }, { "Ꜹ́", "ꜹ́" }, { "Ꜹ̋", "ꜹ̋" }, { "Ꜹ̣", "ꜹ̣" }, { "Ꜹ̨", "ꜹ̨" }, { "Ꜻ", "ꜻ" }, { "W", "w" }, { "Ꝡ", "ꝡ" }, },
    },
    ["W"] = {
      diacritics = { { "Ẃ", "ẃ" }, { "Ẁ", "ẁ" }, { "Ŵ", "ŵ" }, { "Ẅ", "ẅ" }, { "W̃", "w̃" }, { "W̄", "w̄" }, { "Ẇ", "ẇ" }, { "W̊", "ẘ" }, { "W̋", "w̋" }, { "W̓", "w̓" }, { "W̔", "w̔" }, { "Ẉ", "ẉ" }, { "W̤", "w̤" }, { "W̱", "w̱" }, { "Ⱳ", "ⱳ" }, },
      variants = { { "ᴡ" }, { "ʍ" }, },
    },
    ["X"] = {
      diacritics = { { "X́", "x́" }, { "X̂", "x̂" }, { "Ẍ", "ẍ" }, { "X̧", "x̧" }, { "X̄", "x̄" }, { "Ẋ", "ẋ" }, { "X̌", "x̌" }, { "X̣", "x̣" }, { "X̱", "x̱" }, { "ᶍ" }, },
      variants = { { "ꭖ" }, { "ꭗ" }, { "ꭘ" }, { "ꭙ" }, },
    },
    ["Y"] = {
      diacritics = { { "Ý", "ý" }, { "Ỳ", "ỳ" }, { "Ŷ", "ŷ" }, { "Ÿ", "ÿ" }, { "Ỹ", "ỹ" }, { "Ȳ", "ȳ" }, { "Y̆", "y̆" }, { "Ẏ", "ẏ" }, { "Ỷ", "ỷ" }, { "Y̊", "ẙ" }, { "Y̌", "y̌" }, { "Y̓", "y̓" }, { "Ỵ", "ỵ" }, { "Y̨", "y̨" }, { "Y̰", "y̰" }, { "Y̱", "y̱" }, { "Ɏ", "ɏ" }, { "Ƴ", "ƴ" }, { "Ỿ", "ỿ" }, { "Ÿ́", "ÿ́" }, },
      variants = { { "ʏ" }, { "ʎ" }, { "ꭚ" }, { "Ꜽ", "ꜽ" }, { "Ꜽ̇", "ꜽ̇" }, { "Ꜽ̣", "ꜽ̣" }, { "Ꝡ", "ꝡ" }, },
    },
    ["Z"] = {
      diacritics = { { "Ź", "ź" }, { "Z̀", "z̀" }, { "Ẑ", "ẑ" }, { "Z̈", "z̈" }, { "Z̧", "z̧" }, { "Z̃", "z̃" }, { "Z̄", "z̄" }, { "Z̆", "z̆" }, { "Ż", "ż" }, { "Ž", "ž" }, { "Ẓ", "ẓ" }, { "Z̤", "z̤" }, { "Z̭", "z̭" }, { "Ẕ", "ẕ" }, { "Z̦", "z̦" }, { "Ƶ", "ƶ" }, { "Ɀ", "ɀ" }, { "Ⱬ", "ⱬ" }, { "Ȥ", "ȥ" }, { "ʑ" }, { "ʐ" }, { "ᶎ" }, { "ᵶ" }, { "Ž́", "ž́" }, { "Ž̈", "ž̈" }, { "Ž̆", "ž̆" }, { "Ẓ̌", "ẓ̌" }, },
      variants = { { "ᴢ" }, { "Ǳ", "ǲ", "ǳ" }, { "ʣ" }, { "Ǆ", "ǅ", "ǆ" }, { "ʫ" }, { "Ꜩ", "ꜩ" }, },
    },
  },
  diacritics = {
    ["aigu"] = {
      title = "Lettres avec [[accent aigu]] ou [[double accent aigu]]",
      entries = { { "Á", "á" }, { "A̋", "a̋" }, { "Á̧", "á̧" }, { "Ạ́", "ạ́" }, { "Á̤", "á̤" }, { "Ą́", "ą́" }, { "Á̱", "á̱" }, { "Ấ", "ấ" }, { "Ä́", "ä́" }, { "Ã́", "ã́" }, { "Ā́", "ā́" }, { "Ắ", "ắ" }, { "Ȧ́", "ȧ́" }, { "Ǻ", "ǻ" }, { "Ą̄́", "ą̄́" }, { "Ā̱́", "ā̱́" }, { "B́", "b́" }, { "Ć", "ć" }, { "C̋", "c̋" }, { "Ḉ", "ḉ" }, { "Ć̣", "ć̣" }, { "D́", "d́" }, { "É", "é" }, { "E̋", "e̋" }, { "É̈", "é̈" }, { "Ȩ́", "ȩ́" }, { "Ẹ́", "ẹ́" }, { "É̤", "é̤" }, { "Ę́", "ę́" }, { "É̱", "é̱" }, { "Ế", "ế" }, { "Ë́", "ë́" }, { "Ẽ́", "ẽ́" }, { "Ḗ", "ḗ" }, { "Ė́", "ė́" }, { "Ę̋", "ę̋" }, { "Ę̄́", "ę̄́" }, { "Ḗ̱", "ḗ̱" }, { "Ǝ́", "ǝ́" }, { "F́", "f́" }, { "Ǵ", "ǵ" }, { "H́", "h́" }, { "Í", "í" }, { "I̋", "i̋" }, { "Í̧", "í̧" }, { "Ị́", "ị́" }, { "Į́", "į́", "į̇́" }, { "Í̱", "í̱" }, { "Î́", "î́" }, { "Ḯ", "ḯ" }, { "Ĩ́", "ĩ́" }, { "Ī́", "ī́" }, { "Ɨ́", "ɨ́" }, { "Ī̱́", "ī̱́" }, { "J́", "j́" }, { "Ḱ", "ḱ" }, { "Ĺ", "ĺ" }, { "Ḷ́", "ḷ́" }, { "Ĺ̥", "ĺ̥" }, { "Ḿ", "ḿ" }, { "Ṃ́", "ṃ́" }, { "Ń", "ń" }, { "Ṇ́", "ṇ́" }, { "Ó", "ó" }, { "Ő", "ő" }, { "Ó̧", "ó̧" }, { "Ọ́", "ọ́" }, { "Ó̤", "ó̤" }, { "Ǫ́", "ǫ́" }, { "Ó̱", "ó̱" }, { "Ó̲", "ó̲" }, { "Ố", "ố" }, { "Ö́", "ö́" }, { "Ṍ", "ṍ" }, { "Ṓ", "ṓ" }, { "Ớ", "ớ" }, { "Ó͘", "ó͘" }, { "Ǿ", "ǿ" }, { "Ɵ́", "ɵ́" }, { "Ǭ́", "ǭ́" }, { "Ṓ̱", "ṓ̱" }, { "Ṕ", "ṕ" }, { "Q́", "q́" }, { "Ŕ", "ŕ" }, { "Ṛ́", "ṛ́" }, { "Ŕ̥", "ŕ̥" }, { "Ś", "ś" }, { "Ṥ", "ṥ" }, { "Ṣ́", "ṣ́" }, { "Š́", "š́" }, { "T́", "t́" }, { "Ṭ́", "ṭ́" }, { "Ú", "ú" }, { "Ű", "ű" }, { "Ú̧", "ú̧" }, { "Ụ́", "ụ́" }, { "Ṳ́", "ṳ́" }, { "Ų́", "ų́" }, { "Ṵ́", "ṵ́" }, { "Ú̱", "ú̱" }, { "Ú̲", "ú̲" }, { "Û́", "û́" }, { "Ǘ", "ǘ" }, { "Ṹ", "ṹ" }, { "Ū́", "ū́" }, { "Ứ", "ứ" }, { "Ʉ́", "ʉ́" }, { "Ų̄́", "ų̄́" }, { "Ū̱́", "ū̱́" }, { "Ʉ̃́", "ʉ̃́" }, { "Ʉ̃́", "ʉ̃́" }, { "V́", "v́" }, { "Ẃ", "ẃ" }, { "W̋", "w̋" }, { "X́", "x́" }, { "Ý", "ý" }, { "Ÿ́", "ÿ́" }, { "Ź", "ź" }, { "Ž́", "ž́" }, { "Ɑ́", "ɑ́" }, { "Ꝺ́", "ꝺ́" }, { "Ə́", "ə́" }, { "Ə̧́", "ə̧́" }, { "Ə̣́", "ə̣́" }, { "Ɛ́", "ɛ́" }, { "Ɛ̧́", "ɛ̧́" }, { "Ɛ̨́", "ɛ̨́" }, { "Ɛ̰́", "ɛ̰́" }, { "Ɛ̃́", "ɛ̃́" }, { "Ɩ́", "ɩ́" }, { "Ɩ̃́", "ɩ̃́" }, { "Ŋ́", "ŋ́" }, { "Ɔ́", "ɔ́" }, { "Ɔ̧́", "ɔ̧́" }, { "Ɔ̰́", "ɔ̰́" }, { "Ɔ̃́", "ɔ̃́" }, { "Ʊ́", "ʊ́" }, { "Ʋ́", "ʋ́" }, { "Ʋ̃́", "ʋ̃́" }, { "Ꜳ́", "ꜳ́" }, { "Ꜳ̋", "ꜳ̋" }, { "Ǽ", "ǽ" }, { "Æ̋", "æ̋" }, { "Ǽ̨", "ǽ̨" }, { "Ǣ́", "ǣ́" }, { "Ꜵ́", "ꜵ́" }, { "Ꜵ̋", "ꜵ̋" }, { "Ꜷ́", "ꜷ́" }, { "Ꜹ́", "ꜹ́" }, { "Ꜹ̋", "ꜹ̋" }, { "Œ́", "œ́" }, },
    },
    ["grave"] = {
      title = "Lettres avec [[accent grave]] ou [[double accent grave]]",
      entries = { { "À", "à" }, { "Ȁ", "ȁ" }, { "À̧", "à̧" }, { "Ạ̀", "ạ̀" }, { "À̤", "à̤" }, { "Ą̀", "ą̀" }, { "À̱", "à̱" }, { "Ầ", "ầ" }, { "Ä̀", "ä̀" }, { "Ã̀", "ã̀" }, { "Ā̀", "ā̀" }, { "Ằ", "ằ" }, { "Ą̈̀", "ą̈̀" }, { "Ą̄̀", "ą̄̀" }, { "Ā̱̀", "ā̱̀" }, { "B̀", "b̀" }, { "C̀", "c̀" }, { "È", "è" }, { "Ȅ", "ȅ" }, { "Ȩ̀", "ȩ̀" }, { "Ẹ̀", "ẹ̀" }, { "È̤", "è̤" }, { "Ę̀", "ę̀" }, { "È̱", "è̱" }, { "È̲", "è̲" }, { "Ề", "ề" }, { "Ể", "ể" }, { "Ë̀", "ë̀" }, { "Ẽ̀", "ẽ̀" }, { "Ę̈̀", "ę̈̀" }, { "Ę̄̀", "ę̄̀" }, { "Ḕ̱", "ḕ̱" }, { "Ǝ̀", "ǝ̀" }, { "F̀", "F̀" }, { "G̀", "g̀" }, { "Ì", "ì" }, { "Ȉ", "ȉ" }, { "Ì̧", "ì̧" }, { "Į̀", "į̀" }, { "Ì̱", "ì̱" }, { "Ĩ̀", "ĩ̀" }, { "Ī̀", "ī̀" }, { "Ɨ̀", "ɨ̀" }, { "Ī̱̀", "ī̱̀" }, { "Ɨ̧̀", "ɨ̧̀" }, { "K̀", "k̀" }, { "L̀", "l̀" }, { "Ḷ̀", "ḷ̀" }, { "L̥̀", "l̥̀" }, { "M̀", "m̀" }, { "Ǹ", "ǹ" }, { "Ò", "ò" }, { "Ȍ", "ȍ" }, { "Ò̧", "ò̧" }, { "Ọ̀", "ọ̀" }, { "Ò̤", "ò̤" }, { "Ǫ̀", "ǫ̀" }, { "Ò̱", "ò̱" }, { "Ò̲", "ò̲" }, { "Ồ", "ồ" }, { "Ö̀", "ö̀" }, { "Õ̀", "õ̀" }, { "Ṑ", "ṑ" }, { "Ờ", "ờ" }, { "Ò͘", "ò͘" }, { "Ø̀", "ø̀" }, { "Ɵ̀", "ɵ̀" }, { "Ǭ̀", "ǭ̀" }, { "Ṑ̱", "ṑ̱" }, { "P̀", "p̀" }, { "R̀", "r̀" }, { "Ȑ", "ȑ" }, { "Ṛ̀", "ṛ̀" }, { "R̥̀", "r̥̀" }, { "S̀", "s̀" }, { "T̀", "t̀" }, { "Ù", "ù" }, { "Ȕ", "ȕ" }, { "Ù̧", "ù̧" }, { "Ụ̀", "ụ̀" }, { "Ṳ̀", "ṳ̀" }, { "Ų̀", "ų̀" }, { "Ṵ̀", "ṵ̀" }, { "Ù̱", "ù̱" }, { "Ǜ", "ǜ" }, { "Ũ̀", "ũ̀" }, { "Ū̀", "ū̀" }, { "Ừ", "ừ" }, { "Ʉ̀", "ʉ̀" }, { "Ų̄̀", "ų̄̀" }, { "Ū̱̀", "ū̱̀" }, { "V̀", "v̀" }, { "Ʌ̀", "ʌ̀" }, { "Ẁ", "ẁ" }, { "Ỳ", "ỳ" }, { "Z̀", "z̀" }, { "Ɑ̀", "ɑ̀" }, { "Ə̀", "ə̀" }, { "Ə̧̀", "ə̧̀" }, { "Ə̣̀", "ə̣̀" }, { "Ɛ̀", "ɛ̀" }, { "Ɛ̰̀", "ɛ̰̀" }, { "Ɛ̃̀", "ɛ̃̀" }, { "Ɩ̀", "ɩ̀" }, { "Ɩ̃̀", "ɩ̃̀" }, { "Ŋ̀", "ŋ̀" }, { "Ɔ̀", "ɔ̀" }, { "Ɔ̧̀", "ɔ̧̀" }, { "Ɔ̃̀", "ɔ̃̀" }, { "Ʊ̀", "ʊ̀" }, { "Ʋ̀", "ʋ̀" }, { "Ʋ̃̀", "ʋ̃̀" }, { "Æ̀", "æ̀" }, { "Œ̀", "œ̀" }, },
    },
    ["circonflexe"] = {
      title = "Lettres avec [[accent circonflexe]]",
      entries = { { "Â", "â" }, { "Ấ", "ấ" }, { "Ầ", "ầ" }, { "Â̧", "â̧" }, { "Ẫ", "ẫ" }, { "Ẩ", "ẩ" }, { "Ậ", "ậ" }, { "Â̤", "â̤" }, { "Ą̂", "ą̂" }, { "Â̱", "â̱" }, { "Ä̂", "ä̂" }, { "Ã̂", "ã̂" }, { "Ā̂", "ā̂" }, { "Å̂", "å̂" }, { "Ą̈̂", "ą̈̂" }, { "Ą̄̂", "ą̄̂" }, { "Ā̱̂", "ā̱̂" }, { "Ĉ", "ĉ" }, { "D̂", "d̂" }, { "Ê", "ê" }, { "Ế", "ế" }, { "Ề", "ề" }, { "Ȩ̂", "ȩ̂" }, { "Ễ", "ễ" }, { "Ê̄", "ê̄" }, { "Ê̆", "ê̆" }, { "Ê̌", "ê̌" }, { "Ệ", "ệ" }, { "Ê̤", "ê̤" }, { "Ę̂", "ę̂" }, { "Ê̱", "ê̱" }, { "Ë̂", "ë̂" }, { "Ẽ̂", "ẽ̂" }, { "Ē̂", "ē̂" }, { "Ę̈̂", "ę̈̂" }, { "Ę̄̂", "ę̄̂" }, { "Ē̱̂", "ē̱̂" }, { "Ǝ̂", "ǝ̂" }, { "Ĝ", "ĝ" }, { "Ĥ", "ĥ" }, { "Î", "î" }, { "Î́", "î́" }, { "Î̧", "î̧" }, { "Ị̂", "ị̂" }, { "Ï̂", "ï̂" }, { "Ĩ̂", "ĩ̂" }, { "Ī̂", "ī̂" }, { "Į̂", "į̂" }, { "Î̱", "î̱" }, { "Ɨ̂", "ɨ̂" }, { "Ī̱̂", "ī̱̂" }, { "Ɨ̧̂", "ɨ̧̂" }, { "Ĵ", "ĵ" }, { "L̂", "l̂" }, { "M̂", "m̂" }, { "N̂", "n̂" }, { "Ô", "ô" }, { "Ố", "ố" }, { "Ồ", "ồ" }, { "Ô̧", "ô̧" }, { "Ỗ", "ỗ" }, { "Ō̂", "ō̂" }, { "Ô̆", "ô̆" }, { "Ổ", "ổ" }, { "Ộ", "ộ" }, { "Ô̤", "ô̤" }, { "Ǫ̂", "ǫ̂" }, { "Ô̱", "ô̱" }, { "Ô͘", "ô͘" }, { "Ø̂", "ø̂" }, { "Ɵ̂", "ɵ̂" }, { "Ǭ̂", "ǭ̂" }, { "Ō̱̂", "ō̱̂" }, { "R̂", "r̂" }, { "Ŝ", "ŝ" }, { "Û", "û" }, { "Û́", "û́" }, { "Û̧", "û̧" }, { "Ụ̂", "ụ̂" }, { "Ṳ̂", "ṳ̂" }, { "Ų̂", "ų̂" }, { "Û̱", "û̱" }, { "Ü̂", "ü̂" }, { "Ũ̂", "ũ̂" }, { "Ū̂", "ū̂" }, { "Ʉ̂", "ʉ̂" }, { "Ų̄̂", "ų̄̂" }, { "Ū̱̂", "ū̱̂" }, { "Ʌ̂", "ʌ̂" }, { "Ŵ", "ŵ" }, { "X̂", "x̂" }, { "Ŷ", "ŷ" }, { "Ẑ", "ẑ" }, { "Ɑ̂", "ɑ̂" }, { "Ə̂", "ə̂" }, { "Ɛ̂", "ɛ̂" }, { "Ɛ̧̂", "ɛ̧̂" }, { "Ɛ̃̂", "ɛ̃̂" }, { "Ŋ̂", "ŋ̂" }, { "Ɔ̂", "ɔ̂" }, { "Ɔ̧̂", "ɔ̧̂" }, { "Ɔ̃̂", "ɔ̃̂" }, { "Æ̂", "æ̂" }, { "Œ̂", "œ̂" }, },
    },
    ["tréma"] = {
      title = "Lettres avec [[tréma]] ([[diérèse]]) ou ''[[umlaut]]''",
      entries = { { "Ä", "ä" }, { "Ä́", "ä́" }, { "Ä̀", "ä̀" }, { "Ä̂", "ä̂" }, { "Ä̃", "ä̃" }, { "Ǟ", "ǟ" }, { "Ä̌", "ä̌" }, { "Ạ̈", "ạ̈" }, { "Ą̈", "ą̈" }, { "Ä̱", "ä̱" }, { "Ą̈̀", "ą̈̀" }, { "Ą̈̂", "ą̈̂" }, { "Ą̈̌", "ą̈̌" }, { "C̈", "c̈" }, { "Č̈", "č̈" }, { "Ë", "ë" }, { "É̈", "é̈" }, { "Ë́", "ë́" }, { "Ë̀", "ë̀" }, { "Ë̂", "ë̂" }, { "Ë̃", "ë̃" }, { "Ë̌", "ë̌" }, { "Ę̈", "ę̈" }, { "Ë̱", "ë̱" }, { "Ę̈̀", "ę̈̀" }, { "Ę̈̂", "ę̈̂" }, { "Ę̈̌", "ę̈̌" }, { "G̈", "g̈" }, { "Ǧ̈", "ǧ̈" }, { "Ḧ", "ḧ" }, { "Ï", "ï" }, { "Ḯ", "ḯ" }, { "Ï̂", "ï̂" }, { "Ɨ̈", "ɨ̈" }, { "J̈", "j̈" }, { "K̈", "k̈" }, { "L̈", "l̈" }, { "M̈", "m̈" }, { "N̈", "n̈" }, { "Ñ̈", "ñ̈" }, { "Ö", "ö" }, { "Ö́", "ö́" }, { "Ö̀", "ö̀" }, { "Ȫ", "ȫ" }, { "Ö̱", "ö̱" }, { "Ṏ", "ṏ" }, { "P̈", "p̈" }, { "Q̈", "q̈" }, { "S̈", "s̈" }, { "T̈", "ẗ" }, { "Ü", "ü" }, { "Ǘ", "ǘ" }, { "Ǜ", "ǜ" }, { "Ü̂", "ü̂" }, { "Ü̃", "ü̃" }, { "Ǖ", "ǖ" }, { "Ǚ", "ǚ" }, { "Ų̈", "ų̈" }, { "Ṻ", "ṻ" }, { "Ʉ̈", "ʉ̈" }, { "ᴞ" }, { "V̈", "v̈" }, { "Ʌ̈", "ʌ̈" }, { "Ẅ", "ẅ" }, { "Ẍ", "ẍ" }, { "Ÿ", "ÿ" }, { "Ÿ́", "ÿ́" }, { "Z̈", "z̈" }, { "Ž̈", "ž̈" }, { "Ɛ̈", "ɛ̈" }, { "Ɛ̱̈", "ɛ̱̈" }, { "Ŋ̈", "ŋ̈" }, { "Ɔ̈", "ɔ̈" }, { "Ʋ̈", "ʋ̈" }, { "Ꜳ̈", "ꜳ̈" }, { "Æ̈", "æ̈" }, { "Œ̈", "œ̈" }, },
    },
    ["cédille"] = {
      title = "Lettres avec [[cédille]]",
      entries = { { "A̧", "a̧" }, { "Á̧", "á̧" }, { "À̧", "à̧" }, { "Â̧", "â̧" }, { "Ǎ̧", "ǎ̧" }, { "Ç", "ç" }, { "Ḉ", "ḉ" }, { "Ç̆", "ç̆" }, { "Ç̇", "ç̇" }, { "Ç̌", "ç̌" }, { "Ḑ", "ḑ" }, { "Ȩ", "ȩ" }, { "Ȩ́", "ȩ́" }, { "Ȩ̀", "ȩ̀" }, { "Ȩ̂", "ȩ̂" }, { "Ḝ", "ḝ" }, { "Ȩ̌", "ȩ̌" }, { "F̧", "f̧" }, { "Ģ", "ģ" }, { "Ḩ", "ḩ" }, { "I̧", "i̧" }, { "Í̧", "í̧" }, { "Ì̧", "ì̧" }, { "Î̧", "î̧" }, { "Ɨ̧", "ɨ̧" }, { "Ɨ̧̀", "ɨ̧̀" }, { "Ɨ̧̂", "ɨ̧̂" }, { "Ɨ̧̌", "ɨ̧̌" }, { "J̧", "j̧" }, { "Ķ", "ķ" }, { "Ļ", "ļ" }, { "M̧", "m̧" }, { "Ņ", "ņ" }, { "O̧", "o̧" }, { "Ó̧", "ó̧" }, { "Ò̧", "ò̧" }, { "Ô̧", "ô̧" }, { "Ǒ̧", "ǒ̧" }, { "Ŗ", "ŗ" }, { "Ş", "ş" }, { "Ş̄", "ş̄" }, { "Ţ", "ţ" }, { "U̧", "u̧" }, { "Ú̧", "ú̧" }, { "Ù̧", "ù̧" }, { "Û̧", "û̧" }, { "Ǔ̧", "ǔ̧" }, { "X̧", "x̧" }, { "Z̧", "z̧" }, { "Ə̧", "ə̧" }, { "Ə̧́", "ə̧́" }, { "Ə̧̀", "ə̧̀" }, { "Ɛ̧", "ɛ̧" }, { "Ɛ̧́", "ɛ̧́" }, { "Ɛ̧̂", "ɛ̧̂" }, { "Ɔ̧", "ɔ̧" }, { "Ɔ̧́", "ɔ̧́" }, { "Ɔ̧̀", "ɔ̧̀" }, { "Ɔ̧̂", "ɔ̧̂" }, { "Ɔ̧̌", "ɔ̧̌" }, },
    },
    ["tilde"] = {
      title = "Lettres avec [[tilde]]",
      entries = { { "Ã", "ã" }, { "Ẫ", "ẫ" }, { "Ä̃", "ä̃" }, { "Ã́", "ã́" }, { "Ã̀", "ã̀" }, { "Ã̂", "ã̂" }, { "Ã̌", "ã̌" }, { "Ã̍", "ã̍" }, { "Ạ̃", "ạ̃" }, { "Ą̃", "ą̃" }, { "Ẵ", "ẵ" }, { "B̃", "b̃" }, { "C̃", "c̃" }, { "Ẽ", "ẽ" }, { "Ễ", "ễ" }, { "Ë̃", "ë̃" }, { "Ẽ́", "ẽ́" }, { "Ẽ̀", "ẽ̀" }, { "Ẽ̂", "ẽ̂" }, { "Ẽ̌", "ẽ̌" }, { "Ẽ̍", "ẽ̍" }, { "Ẹ̃", "ẹ̃" }, { "Ę̃", "ę̃" }, { "Ė̃", "ė̃" }, { "Ǝ̃", "ǝ̃" }, { "G̃", "g̃" }, { "Ĩ", "ĩ" }, { "Ĩ́", "ĩ́" }, { "Ĩ̀", "ĩ̀" }, { "Ĩ̂", "ĩ̂" }, { "Ĩ̌", "ĩ̌" }, { "Ĩ̍", "ĩ̍" }, { "Ị̃", "ị̃" }, { "Į̃", "į̃", "į̇̃" }, { "Ɨ̃", "ɨ̃" }, { "J̃", "j̃", "j̇̃" }, { "L̃", "l̃" }, { "M̃", "m̃" }, { "Ñ", "ñ" }, { "Ñ̈", "ñ̈" }, { "Õ", "õ" }, { "Ỗ", "ỗ" }, { "Ṍ", "ṍ" }, { "Õ̀", "õ̀" }, { "Ṏ", "ṏ" }, { "Ȭ", "ȭ" }, { "Ọ̃", "ọ̃" }, { "Ỡ", "ỡ" }, { "Ø̃", "ø̃" }, { "P̃", "p̃" }, { "Q̃", "q̃" }, { "R̃", "r̃" }, { "T̃", "t̃" }, { "Ũ", "ũ" }, { "Ü̃", "ü̃" }, { "Ṹ", "ṹ" }, { "Ũ̀", "ũ̀" }, { "Ũ̂", "ũ̂" }, { "Ũ̌", "ũ̌" }, { "Ũ̍", "ũ̍" }, { "Ụ̃", "ụ̃" }, { "Ų̃", "ų̃" }, { "Ū̃", "ū̃" }, { "Ữ", "ữ" }, { "Ʉ̃", "ʉ̃" }, { "Ʉ̃́", "ʉ̃́" }, { "Ṽ", "ṽ" }, { "W̃", "w̃" }, { "Ỹ", "ỹ" }, { "Z̃", "z̃" }, { "Ə̃", "ə̃" }, { "Ɛ̃", "ɛ̃" }, { "Ɛ̃́", "ɛ̃́" }, { "Ɛ̃̀", "ɛ̃̀" }, { "Ɛ̃̂", "ɛ̃̂" }, { "Ɛ̃̌", "ɛ̃̌" }, { "Ɛ̃̍", "ɛ̃̍" }, { "Ɩ̃", "ɩ̃" }, { "Ɩ̃́", "ɩ̃́" }, { "Ɩ̃̀", "ɩ̃̀" }, { "Ɯ̃", "ɯ̃" }, { "Ɔ̃", "ɔ̃" }, { "Ɔ̃́", "ɔ̃́" }, { "Ɔ̃̀", "ɔ̃̀" }, { "Ɔ̃̂", "ɔ̃̂" }, { "Ɔ̃̌", "ɔ̃̌" }, { "Ɔ̃̍", "ɔ̃̍" }, { "Ʌ̃", "ʌ̃" }, { "Ʋ̃", "ʋ̃" }, { "Ʋ̃́", "ʋ̃́" }, { "Ʋ̃̀", "ʋ̃̀" }, { "Æ̃", "æ̃" }, },
    },
    ["macron"] = {
      title = "Lettres avec [[macron]]",
      entries = { { "Ā", "ā" }, { "Ǟ", "ǟ" }, { "Ā́", "ā́" }, { "Ā̀", "ā̀" }, { "Ā̂", "ā̂" }, { "Ā̆", "ā̆" }, { "Ā̊", "ā̊" }, { "Ā̌", "ā̌" }, { "Ạ̄", "ạ̄" }, { "Ā̤", "ā̤" }, { "Ą̄", "ą̄" }, { "Ā̱", "ā̱" }, { "Ǡ", "ǡ" }, { "Ą̄́", "ą̄́" }, { "Ā̱́", "ā̱́" }, { "Ą̄̀", "ą̄̀" }, { "Ā̱̀", "ā̱̀" }, { "Ą̄̂", "ą̄̂" }, { "Ā̱̂", "ā̱̂" }, { "Ą̄̌", "ą̄̌" }, { "B̄", "b̄" }, { "C̄", "c̄" }, { "D̄", "d̄" }, { "Ḍ̄", "ḍ̄" }, { "Ē", "ē" }, { "Ê̄", "ê̄" }, { "Ḗ", "ḗ" }, { "Ē̂", "ē̂" }, { "Ē̆", "ē̆" }, { "Ē̌", "ē̌" }, { "Ẹ̄", "ẹ̄" }, { "Ē̤", "ē̤" }, { "Ę̄", "ę̄" }, { "Ē̱", "ē̱" }, { "Ė̄", "ė̄" }, { "Ę̄́", "ę̄́" }, { "Ḗ̱", "ḗ̱" }, { "Ę̄̀", "ę̄̀" }, { "Ḕ̱", "ḕ̱" }, { "Ę̄̂", "ę̄̂" }, { "Ē̱̂", "ē̱̂" }, { "Ǝ̄", "ǝ̄" }, { "F̄", "f̄" }, { "Ḡ", "ḡ" }, { "H̄", "h̄" }, { "Ī", "ī" }, { "Ī́", "ī́" }, { "Ī̀", "ī̀" }, { "Ī̂", "ī̂" }, { "Ī̱", "ī̱" }, { "Ɨ̄", "ɨ̄" }, { "Ī̱́", "ī̱́" }, { "Ī̱̀", "ī̱̀" }, { "Ī̱̂", "ī̱̂" }, { "J̄", "j̄" }, { "K̄", "k̄" }, { "Ḹ", "ḹ" }, { "L̤̄", "l̤̄" }, { "L̥̄", "l̥̄" }, { "L̮̄", "l̮̄" }, { "M̄", "m̄" }, { "N̄", "n̄" }, { "Ō", "ō" }, { "Ȫ", "ȫ" }, { "Ȭ", "ȭ" }, { "Ṓ", "ṓ" }, { "Ṑ", "ṑ" }, { "Ō̂", "ō̂" }, { "Ō̆", "ō̆" }, { "Ō̌", "ō̌" }, { "Ọ̄", "ọ̄" }, { "Ō̤", "ō̤" }, { "Ǭ", "ǭ" }, { "Ō̱", "ō̱" }, { "Ȱ", "ȱ" }, { "Ō͘", "ō͘" }, { "Ø̄", "ø̄" }, { "Ǭ́", "ǭ́" }, { "Ṓ̱", "ṓ̱" }, { "Ǭ̀", "ǭ̀" }, { "Ṑ̱", "ṑ̱" }, { "Ō̱̂", "ō̱̂" }, { "Ǭ̂", "ǭ̂" }, { "P̄", "p̄" }, { "Q̄", "q̄" }, { "R̄", "r̄" }, { "Ṝ", "ṝ" }, { "R̥̄", "r̥̄" }, { "R̮̄", "r̮̄" }, { "S̄", "s̄" }, { "Ş̄", "ş̄" }, { "Ṣ̄", "ṣ̄" }, { "T̄", "t̄" }, { "Ū", "ū" }, { "Ǖ", "ǖ" }, { "Ū́", "ū́" }, { "Ū̂", "ū̂" }, { "Ṻ", "ṻ" }, { "Ū̃", "ū̃" }, { "Ū̌", "ū̌" }, { "Ụ̄", "ụ̄" }, { "Ṳ̄", "ṳ̄" }, { "Ų̄", "ų̄" }, { "Ṵ̄", "ṵ̄" }, { "Ū̱", "ū̱" }, { "Ư̄", "ư̄" }, { "Ʉ̄", "ʉ̄" }, { "Ų̄́", "ų̄́" }, { "Ū̱́", "ū̱́" }, { "Ų̄̀", "ų̄̀" }, { "Ū̱̀", "ū̱̀" }, { "Ų̄̂", "ų̄̂" }, { "Ū̱̂", "ū̱̂" }, { "Ų̄̌", "ų̄̌" }, { "V̄", "v̄" }, { "W̄", "w̄" }, { "X̄", "x̄" }, { "Ȳ", "ȳ" }, { "Z̄", "z̄" }, { "Ə̄", "ə̄" }, { "Ɛ̄", "ɛ̄" }, { "Ɛ̰̄", "ɛ̰̄" }, { "Ŋ̄", "ŋ̄" }, { "Ɔ̄", "ɔ̄" }, { "Ɔ̰̄", "ɔ̰̄" }, { "Ǣ", "ǣ" }, { "Ǣ́", "ǣ́" }, { "Ǣ̆", "ǣ̆" }, { "Œ̄", "œ̄" }, },
    },
    ["brève"] = {
      title = "Lettres avec [[brève]]",
      entries = { { "Ă", "ă" }, { "Ā̆", "ā̆" }, { "Ắ", "ắ" }, { "Ằ", "ằ" }, { "Ẵ", "ẵ" }, { "Ẳ", "ẳ" }, { "Ặ", "ặ" }, { "Ă̤", "ă̤" }, { "C̆", "c̆" }, { "Ç̆", "ç̆" }, { "Ĕ", "ĕ" }, { "Ê̆", "ê̆" }, { "Ē̆", "ē̆" }, { "Ḝ", "ḝ" }, { "Ĕ̤", "ĕ̤" }, { "Ğ", "ğ" }, { "Ĭ", "ĭ" }, { "N̆", "n̆" }, { "Ŏ", "ŏ" }, { "Ô̆", "ô̆" }, { "Ō̆", "ō̆" }, { "Ŏ̤", "ŏ̤" }, { "Ơ̆", "ơ̆" }, { "Ŭ", "ŭ" }, { "Ṳ̆", "ṳ̆" }, { "Ư̆", "ư̆" }, { "Y̆", "y̆" }, { "Z̆", "z̆" }, { "Ž̆", "ž̆" }, { "Æ̆", "æ̆" }, { "Ǣ̆", "ǣ̆" }, },
    },
    ["point en chef"] = {
      title = "Lettres avec [[point en chef]]",
      entries = { { "Ȧ", "ȧ" }, { "Ȧ́", "ȧ́" }, { "Ǡ", "ǡ" }, { "Ḃ", "ḃ" }, { "Ċ", "ċ" }, { "Ç̇", "ç̇" }, { "Ḋ", "ḋ" }, { "Ė", "ė" }, { "Ė́", "ė́" }, { "Ė̃", "ė̃" }, { "Ė̄", "ė̄" }, { "Ę̇", "ę̇" }, { "Ḟ", "ḟ" }, { "Ġ", "ġ" }, { "Ḣ", "ḣ" }, { "İ", "i" }, { "J̇", "j" }, { "K̇", "k̇" }, { "L̇", "l̇" }, { "Ṁ", "ṁ" }, { "Ṅ", "ṅ" }, { "Ȯ", "ȯ" }, { "Ȱ", "ȱ" }, { "Ṗ", "ṗ" }, { "Q̇", "q̇" }, { "Ṙ", "ṙ" }, { "Ṡ", "ṡ" }, { "Ṥ", "ṥ" }, { "Ṩ", "ṩ" }, { "Ṧ", "ṧ" }, { "Ṫ", "ṫ" }, { "U̇", "u̇" }, { "Ẇ", "ẇ" }, { "Ẋ", "ẋ" }, { "Ẏ", "ẏ" }, { "Ż", "ż" }, { "Ꝺ̇", "ꝺ̇" }, { "Ə̈", "ə̈" }, { "Ṡ", "ẛ" }, { "Ꜳ̇", "ꜳ̇" }, { "Æ̇", "æ̇" }, { "Ꜽ̇", "ꜽ̇" }, },
    },
    ["crochet"] = {
      title = "Lettres avec [[crochet en chef]]",
      entries = { { "Ả", "ả" }, { "Ẩ", "ẩ" }, { "Ẳ", "ẳ" }, { "Ẻ", "ẻ" }, { "Ể", "ể" }, { "Ỉ", "ỉ" }, { "Ỏ", "ỏ" }, { "Ổ", "ổ" }, { "Ở", "ở" }, { "Ủ", "ủ" }, { "Ử", "ử" }, { "Ỷ", "ỷ" }, },
    },
    ["rond en chef"] = {
      title = "Lettres avec [[rond en chef]]",
      entries = { { "Å", "å" }, { "Ā̊", "ā̊" }, { "Ǻ", "ǻ" }, { "Å̂", "å̂" }, { "Ą̊", "ą̊" }, { "Å̱", "å̱" }, { "I̊", "i̊" }, { "O̊", "o̊" }, { "Q̊", "q̊" }, { "S̊", "s̊" }, { "Ů", "ů" }, { "Ṳ̊", "ṳ̊" }, { "W̊", "ẘ" }, { "Y̊", "ẙ" }, { "Æ̊", "æ̊" }, },
    },
    ["caron"] = {
      title = "Lettres avec [[caron]] (''[[hatchek]]'')",
      entries = { { "Ǎ", "ǎ" }, { "Ä̌", "ä̌" }, { "Ã̌", "ã̌" }, { "Ā̌", "ā̌" }, { "Ǎ̧", "ǎ̧" }, { "Ą̌", "ą̌" }, { "Ą̈̌", "ą̈̌" }, { "Ą̄̌", "ą̄̌" }, { "Č", "č" }, { "Č̈", "č̈" }, { "Ç̌", "ç̌" }, { "Č̓", "č̓" }, { "Č̣", "č̣" }, { "Ď", "ď" }, { "Ě", "ě" }, { "Ê̌", "ê̌" }, { "Ë̌", "ë̌" }, { "Ẽ̌", "ẽ̌" }, { "Ē̌", "ē̌" }, { "Ȩ̌", "ȩ̌" }, { "Ẹ̌", "ẹ̌" }, { "Ę̌", "ę̌" }, { "Ę̈̌", "ę̈̌" }, { "Ǝ̌", "ǝ̌" }, { "Ǧ", "ǧ" }, { "Ǧ̈", "ǧ̈" }, { "Ȟ", "ȟ" }, { "Ǐ", "ǐ" }, { "Ĩ̌", "ĩ̌" }, { "Į̌", "į̌" }, { "Ɨ̌", "ɨ̌" }, { "Ɨ̧̌", "ɨ̧̌" }, { "J̌", "ǰ" }, { "J̣̌", "ǰ̣" }, { "Ǩ", "ǩ" }, { "Ľ", "ľ" }, { "M̌", "m̌" }, { "Ň", "ň" }, { "Ǒ", "ǒ" }, { "Ō̌", "ō̌" }, { "Ǒ̧", "ǒ̧" }, { "Ǫ̌", "ǫ̌" }, { "Ø̌", "ø̌" }, { "Ǭ̌", "ǭ̌" }, { "P̌", "p̌" }, { "Q̌", "q̌" }, { "Ř", "ř" }, { "Š", "š" }, { "Š́", "š́" }, { "Ṧ", "ṧ" }, { "Ṣ̌", "ṣ̌" }, { "Š̤", "š̤" }, { "Ť", "ť" }, { "Ǔ", "ǔ" }, { "Ǚ", "ǚ" }, { "Ũ̌", "ũ̌" }, { "Ū̌", "ū̌" }, { "Ǔ̧", "ǔ̧" }, { "Ų̌", "ų̌" }, { "Ʉ̌", "ʉ̌" }, { "Ų̄̌", "ų̄̌" }, { "V̌", "v̌" }, { "Ʌ̌", "ʌ̌" }, { "X̌", "x̌" }, { "Y̌", "y̌" }, { "Ž", "ž" }, { "Ž́", "ž́" }, { "Ž̈", "ž̈" }, { "Ž̆", "ž̆" }, { "Ẓ̌", "ẓ̌" }, { "Ɑ̌", "ɑ̌" }, { "Ə̌", "ə̌" }, { "Ɛ̌", "ɛ̌" }, { "Ɛ̃̌", "ɛ̃̌" }, { "Ɣ̌", "ɣ̌" }, { "Ɔ̌", "ɔ̌" }, { "Ɔ̃̌", "ɔ̃̌" }, { "Ɔ̧̌", "ɔ̧̌" }, { "Ǯ", "ǯ" }, { "Ǆ", "ǅ", "ǆ" }, { "Œ̌", "œ̌" }, },
    },
    ["ligne verticale"] = {
      title = "Lettres avec [[ligne verticale en chef]]",
      entries = { { "A̍", "a̍" }, { "A̤̍", "a̤̍" }, { "E̍", "e̍" }, { "Ẽ̍", "ẽ̍" }, { "E̤̍", "e̤̍" }, { "I̍", "i̍" }, { "Ĩ̍", "ĩ̍" }, { "M̍", "m̍" }, { "N̍", "n̍" }, { "O̍", "o̍" }, { "O̤̍", "o̤̍" }, { "O̍͘", "o̍͘" }, { "U̍", "u̍" }, { "Ũ̍", "ũ̍" }, { "Ṳ̍", "ṳ̍" }, { "Ɛ̍", "ɛ̍" }, { "Ɛ̃̍", "ɛ̃̍" }, { "Ɔ̍", "ɔ̍" }, { "Ɔ̃̍", "ɔ̃̍" }, },
    },
    ["tchandrabindou"] = {
      title = "Lettres avec [[tchandrabindou]]",
      entries = { { "A̐", "a̐" }, { "H̐", "h̐" }, { "I̐", "i̐" }, { "L̐", "l̐" }, { "M̐", "m̐" }, { "N̐", "n̐" }, { "O̐", "o̐" }, { "U̐", "u̐" }, { "V̐", "v̐" }, },
    },
    ["brève inversée"] = {
      title = "Lettres avec [[brève inversée]]",
      entries = { { "Ȃ", "ȃ" }, { "Ȇ", "ȇ" }, { "Ȋ", "ȋ" }, { "Ȏ", "ȏ" }, { "Ȓ", "ȓ" }, { "Ȗ", "ȗ" }, },
    },
    ["virgule suscrite"] = {
      title = "Lettres avec [[virgule suscrite]]",
      entries = { { "A̓", "a̓" }, { "B̓", "b̓" }, { "C̓", "c̓" }, { "Č̓", "č̓" }, { "D̓", "d̓" }, { "H̓", "h̓" }, { "I̓", "i̓" }, { "Ḵ̓", "ḵ̓" }, { "L̓", "l̓" }, { "Ḷ̓", "ḷ̓" }, { "M̓", "m̓" }, { "Ṃ̓", "ṃ̓" }, { "Ṇ̓", "ṇ̓" }, { "P̓", "p̓" }, { "Q̓", "q̓" }, { "S̓", "s̓" }, { "T̓", "t̓" }, { "U̓", "u̓" }, { "V̓", "v̓" }, { "W̓", "w̓" }, { "Y̓", "y̓" }, { "Ɣ̓", "ɣ̓" }, { "ƛ̓" }, { "ʕ̓" }, },
    },
    ["virgule réfléchie suscrite"] = {
      title = "Lettres avec [[virgule réfléchie suscrite]]",
      entries = { { "P̔", "p̔" }, { "W̔", "w̔" }, },
    },
    ["corne"] = {
      title = "Lettres [[corne#fr|cornues]]",
      entries = { { "E̛", "e̛" }, { "Ơ", "ơ" }, { "Ớ", "ớ" }, { "Ờ", "ờ" }, { "Ỡ", "ỡ" }, { "Ơ̆", "ơ̆" }, { "Ở", "ở" }, { "Ợ", "ợ" }, { "Ư", "ư" }, { "Ứ", "ứ" }, { "Ừ", "ừ" }, { "Ữ", "ữ" }, { "Ư̄", "ư̄" }, { "Ư̆", "ư̆" }, { "Ử", "ử" }, { "Ự", "ự" }, },
    },
    ["point souscrit"] = {
      title = "Lettres avec [[point souscrit]]",
      entries = { { "Ạ", "ạ" }, { "Ạ́", "ạ́" }, { "Ạ̀", "ạ̀" }, { "Ậ", "ậ" }, { "Ạ̈", "ạ̈" }, { "Ạ̃", "ạ̃" }, { "Ạ̄", "ạ̄" }, { "Ặ", "ặ" }, { "Ḅ", "ḅ" }, { "C̣", "c̣" }, { "Ć̣", "ć̣" }, { "Č̣", "č̣" }, { "Ḍ", "ḍ" }, { "Ḍ̄", "ḍ̄" }, { "Ḏ̣", "ḏ̣" }, { "Đ̣", "đ̣" }, { "Ẹ", "ẹ" }, { "Ẹ́", "ẹ́" }, { "Ẹ̀", "ẹ̀" }, { "Ệ", "ệ" }, { "Ẹ̃", "ẹ̃" }, { "Ẹ̄", "ẹ̄" }, { "Ẹ̌", "ẹ̌" }, { "Ę̣", "ę̣" }, { "G̣", "g̣" }, { "Ḥ", "ḥ" }, { "Ị", "ị" }, { "Ị́", "ị́" }, { "Ị̂", "ị̂" }, { "Ị̃", "ị̃" }, { "J̣", "j̣" }, { "J̣̌", "ǰ̣" }, { "Ḳ", "ḳ" }, { "Ḷ", "ḷ" }, { "Ḷ́", "ḷ́" }, { "Ł̣", "ł̣" }, { "Ḷ̓", "ḷ̓" }, { "Ḹ", "ḹ" }, { "Ṃ", "ṃ" }, { "Ṃ́", "ṃ́" }, { "Ṃ̓", "ṃ̓" }, { "Ṇ", "ṇ" }, { "Ṇ́", "ṇ́" }, { "Ṇ̓", "ṇ̓" }, { "Ọ", "ọ" }, { "Ọ́", "ọ́" }, { "Ọ̀", "ọ̀" }, { "Ộ", "ộ" }, { "Ọ̃", "ọ̃" }, { "Ọ̄", "ọ̄" }, { "Ợ", "ợ" }, { "P̣", "p̣" }, { "Q̣", "q̣" }, { "Ṛ", "ṛ" }, { "Ṛ́", "ṛ́" }, { "Ṛ̀", "ṛ̀" }, { "Ṝ", "ṝ" }, { "Ṣ", "ṣ" }, { "Ṣ́", "ṣ́" }, { "Ṣ̄", "ṣ̄" }, { "Ṩ", "ṩ" }, { "Ṣ̌", "ṣ̌" }, { "Ṣ̤", "ṣ̤" }, { "Ṭ", "ṭ" }, { "Ṭ́", "ṭ́" }, { "Ṭ̤", "ṭ̤" }, { "Ṯ̣", "ṯ̣" }, { "Ụ", "ụ" }, { "Ụ́", "ụ́" }, { "Ụ̀", "ụ̀" }, { "Ụ̂", "ụ̂" }, { "Ụ̃", "ụ̃" }, { "Ụ̄", "ụ̄" }, { "Ự", "ự" }, { "Ṿ", "ṿ" }, { "Ẉ", "ẉ" }, { "X̣", "x̣" }, { "Ỵ", "ỵ" }, { "Ẓ", "ẓ" }, { "Ẓ̌", "ẓ̌" }, { "Ð̣", "ð̣" }, { "Ə̣", "ə̣" }, { "Ə̣́", "ə̣́" }, { "Ə̣̀", "ə̣̀" }, { "Ɛ̣", "ɛ̣" }, { "Ɔ̣", "ɔ̣" }, { "Ꜳ̣", "ꜳ̣" }, { "Æ̣", "æ̣" }, { "Ꜵ̣", "ꜵ̣" }, { "Ꜷ̣", "ꜷ̣" }, { "Ꜹ̣", "ꜹ̣" }, { "Ꜽ̣", "ꜽ̣" }, },
    },
    ["tréma souscrit"] = {
      title = "Lettres avec [[tréma souscrit]]",
      entries = { { "A̤", "a̤" }, { "Á̤", "á̤" }, { "À̤", "à̤" }, { "Â̤", "â̤" }, { "Ā̤", "ā̤" }, { "Ă̤", "ă̤" }, { "A̤̍", "a̤̍" }, { "B̤", "b̤" }, { "D̤", "d̤" }, { "E̤", "e̤" }, { "É̤", "é̤" }, { "È̤", "è̤" }, { "Ê̤", "ê̤" }, { "Ē̤", "ē̤" }, { "Ĕ̤", "ĕ̤" }, { "E̤̍", "e̤̍" }, { "G̤", "g̤" }, { "H̤", "h̤" }, { "K̤", "k̤" }, { "L̤", "l̤" }, { "L̤̄", "l̤̄" }, { "O̤", "o̤" }, { "Ó̤", "ó̤" }, { "Ò̤", "ò̤" }, { "Ô̤", "ô̤" }, { "Ō̤", "ō̤" }, { "Ŏ̤", "ŏ̤" }, { "O̤̍", "o̤̍" }, { "P̤", "p̤" }, { "R̤", "r̤" }, { "S̤", "s̤" }, { "Š̤", "š̤" }, { "Ṣ̤", "ṣ̤" }, { "T̤", "t̤" }, { "Ṭ̤", "ṭ̤" }, { "Ṳ", "ṳ" }, { "Ṳ́", "ṳ́" }, { "Ṳ̀", "ṳ̀" }, { "Ṳ̂", "ṳ̂" }, { "Ṳ̄", "ṳ̄" }, { "Ṳ̆", "ṳ̆" }, { "Ṳ̊", "ṳ̊" }, { "Ṳ̍", "ṳ̍" }, { "W̤", "w̤" }, { "Z̤", "z̤" }, },
    },
    ["rond souscrit"] = {
      title = "Lettres avec [[rond souscrit]]",
      entries = { { "Ḁ", "ḁ" }, { "L̥", "l̥" }, { "Ĺ̥", "ĺ̥" }, { "L̥̀", "l̥̀" }, { "L̥̄", "l̥̄" }, { "R̥", "r̥" }, { "Ŕ̥", "ŕ̥" }, { "R̥̀", "r̥̀" }, { "R̥̄", "r̥̄" }, },
    },
    ["virgule"] = {
      title = "Lettres avec [[virgule souscrite]]",
      entries = { { "B̦", "b̦" }, { "C̦", "c̦" }, { "D̦", "d̦" }, { "G̦", "g̦" }, { "H̦", "h̦" }, { "K̦", "k̦" }, { "L̦", "l̦" }, { "M̦", "m̦" }, { "N̦", "n̦" }, { "P̦", "p̦" }, { "R̦", "r̦" }, { "Ș", "ș" }, { "Ț", "ț" }, { "V̦", "v̦" }, { "Z̦", "z̦" }, },
    },
    ["ogonek"] = {
      title = "Lettres avec [[ogonek]]",
      entries = { { "Ą", "ą" }, { "Ą́", "ą́" }, { "Ą̀", "ą̀" }, { "Ą̂", "ą̂" }, { "Ą̈", "ą̈" }, { "Ą̃", "ą̃" }, { "Ą̄", "Ą̄" }, { "Ą̊", "ą̊" }, { "Ą̌", "ą̌" }, { "Ą̈̀", "ą̈̀" }, { "Ą̈̂", "ą̈̂" }, { "Ą̈̌", "ą̈̌" }, { "Ą̄́", "ą̄́" }, { "Ą̄̀", "ą̄̀" }, { "Ą̄̂", "ą̄̂" }, { "Ą̄̌", "ą̄̌" }, { "Ę", "ę" }, { "Ę̀", "ę̀" }, { "Ę̂", "ę̂" }, { "Ę̈", "ę̈" }, { "Ę̃", "ę̃" }, { "Ę̄", "ę̄" }, { "Ę̇", "ę̇" }, { "Ę̋", "ę̋" }, { "Ę̌", "ę̌" }, { "Ę̣", "ę̣" }, { "Ę᷎", "ę᷎" }, { "Ę̈̀", "ę̈̀" }, { "Ę̈̂", "ę̈̂" }, { "Ę̈̌", "ę̈̌" }, { "Ę̄́", "ę̄́" }, { "Ę̄̀", "ę̄̀" }, { "Ę̄̂", "ę̄̂" }, { "Į", "į" }, { "Į́", "į́", "į̇́" }, { "Į̀", "į̀" }, { "Į̂", "į̂" }, { "Į̃", "į̃", "į̇̃" }, { "Į̌", "į̌" }, { "M̨", "m̨" }, { "Ǫ", "ǫ" }, { "Ǫ̀", "ǫ̀" }, { "Ǫ̂", "ǫ̂" }, { "Ǭ", "ǭ" }, { "Ǫ̌", "ǫ̌" }, { "Ø̨", "ø̨" }, { "Ǭ́", "ǭ́" }, { "Ǭ̀", "ǭ̀" }, { "Ǭ̂", "ǭ̂" }, { "Ǭ̌", "ǭ̌" }, { "Ų", "ų" }, { "Ų́", "ų́" }, { "Ų̀", "ų̀" }, { "Ų̂", "ų̂" }, { "Ų̈", "ų̈" }, { "Ų̃", "ų̃" }, { "Ų̄", "ų̄" }, { "Ų̌", "ų̌" }, { "Ų̄́", "ų̄́" }, { "Ų̄̀", "ų̄̀" }, { "Ų̄̂", "ų̄̂" }, { "Ų̄̌", "ų̄̌" }, { "Y̨", "y̨" }, { "Ɛ̨", "ɛ̨" }, { "Ɛ̨́", "ɛ̨́" }, { "Ɔ̨", "ɔ̨" }, { "Æ̨", "æ̨" }, { "Ǽ̨", "ǽ̨" }, { "Ꜹ̨", "ꜹ̨" }, },
    },
    ["circonflexe souscrit"] = {
      title = "Lettres avec [[accent circonflexe souscrit]]",
      entries = { { "A̭", "a̭" }, { "Ḙ", "ḙ" }, { "Ḽ", "ḽ" }, { "M̭", "m̭" }, { "Ṋ", "ṋ" }, { "O̭", "o̭" }, { "S̭", "s̭" }, { "Ṱ", "ṱ" }, { "Ṷ", "ṷ" }, { "Z̭", "z̭" }, },
    },
    ["brève souscrite"] = {
      title = "Lettres avec [[brève souscrite]]",
      entries = { { "Ḫ", "ḫ" }, { "L̮", "l̮" }, { "L̮̄", "l̮̄" }, { "R̮", "r̮" }, { "R̮̄", "r̮̄" }, },
    },
    ["brève inversée souscrite"] = {
      title = "Lettres avec [[brève inversée souscrite]]",
      entries = { { "B̯", "b̯" }, { "T̯", "t̯" }, },
    },
    ["tilde souscrit"] = {
      title = "Lettres avec [[tilde souscrit]]",
      entries = { { "A̰", "a̰" }, { "Ḛ", "ḛ" }, { "Ḭ", "ḭ" }, { "N̰", "n̰" }, { "Ɛ̰", "ɛ̰" }, { "Ɛ̰́", "ɛ̰́" }, { "Ɛ̰̀", "ɛ̰̀" }, { "Ɛ̰̄", "ɛ̰̄" }, { "Ɔ̰", "ɔ̰" }, { "Ɔ̰́", "ɔ̰́" }, { "Ɔ̰̄", "ɔ̰̄" }, { "R̰", "r̰" }, { "T̰", "t̰" }, { "Ṵ", "ṵ" }, { "Ṵ́", "ṵ́" }, { "Ṵ̀", "ṵ̀" }, { "Ṵ̄", "ṵ̄" }, { "Y̰", "y̰" }, },
    },
    ["macron souscrit"] = {
      title = "Lettres avec [[macron souscrit]]",
      entries = { { "A̱", "a̱" }, { "Á̱", "á̱" }, { "À̱", "à̱" }, { "Â̱", "â̱" }, { "Ä̱", "ä̱" }, { "Ā̱", "ā̱" }, { "Å̱", "å̱" }, { "Ā̱́", "ā̱́" }, { "Ā̱̀", "ā̱̀" }, { "Ā̱̂", "ā̱̂" }, { "Ḇ", "ḇ" }, { "C̱", "c̱" }, { "Ḏ", "ḏ" }, { "Ḏ̣", "ḏ̣" }, { "E̱", "e̱" }, { "É̱", "é̱" }, { "È̱", "è̱" }, { "Ê̱", "ê̱" }, { "Ë̱", "ë̱" }, { "Ē̱", "ē̱" }, { "Ḗ̱", "ḗ̱" }, { "Ḕ̱", "ḕ̱" }, { "Ē̱̂", "ē̱̂" }, { "H̱", "ẖ" }, { "I̱", "i̱" }, { "Í̱", "í̱" }, { "Ì̱", "ì̱" }, { "Î̱", "î̱" }, { "Ī̱", "ī̱" }, { "Ī̱́", "ī̱́" }, { "Ī̱̀", "ī̱̀" }, { "Ī̱̂", "ī̱̂" }, { "Ḵ", "ḵ" }, { "Ḻ", "ḻ" }, { "M̱", "m̱" }, { "Ṉ", "ṉ" }, { "O̱", "o̱" }, { "Ó̱", "ó̱" }, { "Ò̱", "ò̱" }, { "Ô̱", "ô̱" }, { "Ö̱", "ö̱" }, { "Ō̱", "ō̱" }, { "Ṓ̱", "ṓ̱" }, { "Ṑ̱", "ṑ̱" }, { "Ō̱̂", "ō̱̂" }, { "P̱", "p̱" }, { "Q̱", "q̱" }, { "Ṟ", "ṟ" }, { "S̱", "s̱" }, { "Ṯ", "ṯ" }, { "Ṯ̣", "ṯ̣" }, { "U̱", "u̱" }, { "Ú̱", "ú̱" }, { "Ù̱", "ù̱" }, { "Û̱", "û̱" }, { "Ū̱", "ū̱" }, { "Ū̱́", "ū̱́" }, { "Ū̱̀", "ū̱̀" }, { "Ū̱̂", "ū̱̂" }, { "V̱", "v̱" }, { "W̱", "w̱" }, { "X̱", "x̱" }, { "Y̱", "y̱" }, { "Ẕ", "ẕ" }, { "Ɛ̱", "ɛ̱" }, { "Ɛ̱̈", "ɛ̱̈" }, { "Ḵ̓", "ḵ̓" }, { "Ɔ̱", "ɔ̱" }, },
    },
    ["trait souscrit"] = {
      title = "Lettres avec [[trait souscrit]]",
      entries = { { "A̲", "a̲" }, { "D̲", "d̲" }, { "E̲", "e̲" }, { "È̲", "è̲" }, { "N̲", "n̲" }, { "O̲", "o̲" }, { "Ó̲", "ó̲" }, { "Ò̲", "ò̲" }, { "T̲", "t̲" }, { "U̲", "u̲" }, { "Ú̲", "ú̲" }, { "Ʌ̲", "ʌ̲" }, },
    },
    ["point suscrit à droite"] = {
      title = "Lettres avec [[point suscrit à droite]]",
      entries = { { "O͘", "o͘" }, { "Ó͘", "ó͘" }, { "Ò͘", "ò͘" }, { "Ô͘", "ô͘" }, { "Ō͘", "ō͘" }, { "O̍͘", "o̍͘" }, },
    },
    ["macron-grave"] = {
      title = "Lettres avec [[macron-grave]]",
      entries = { { "E᷆", "e᷆" }, { "U᷆", "u᷆" }, { "Ɛ᷆", "ɛ᷆" }, { "Ɔ᷆", "ɔ᷆" }, },
    },
    ["aigu-macron"] = {
      title = "Lettres avec [[aigu-macron]]",
      entries = { { "E᷇", "e᷇" }, { "U᷇", "u᷇" }, { "Ɛ᷇", "ɛ᷇" }, { "Ɔ᷇", "ɔ᷇" }, },
    },
    ["ogonek suscrit"] = {
      title = "Lettres avec [[ogonek suscrit]]",
      entries = { { "A᷎", "a᷎" }, { "E᷎", "e᷎" }, { "Ę᷎", "ę᷎" }, },
    },
    ------------------------
    ["barré"] = {
      title = "Lettres [[barré#fr|barrées]] ou rayées",
      entries = { { "Ⱥ", "ⱥ" }, { "Ƀ", "ƀ" }, { "ᴃ" }, { "Ȼ", "ȼ" }, { "Ꞓ", "ꞓ" }, { "Đ", "đ" }, { "Đ̣", "đ̣" }, { "ᴆ" }, { "Ɇ", "ɇ" }, { "ꬳ" }, { "Ꞙ", "ꞙ" }, { "Ꞡ", "ꞡ" }, { "Ǥ", "ǥ" }, { "Ħ", "ħ" }, { "Ɨ", "ɨ" }, { "Ɨ́", "ɨ́" }, { "Ɨ̀", "ɨ̀" }, { "Ɨ̂", "ɨ̂" }, { "Ɨ̈", "ɨ̈" }, { "Ɨ̧", "ɨ̧" }, { "Ɨ̃", "ɨ̃" }, { "Ɨ̄", "ɨ̄" }, { "Ɨ̌", "ɨ̌" }, { "Ɨ̧̀", "ɨ̧̀" }, { "Ɨ̧̂", "ɨ̧̂" }, { "Ɨ̧̌", "ɨ̧̌" }, { "ᵻ" }, { "Ɉ", "ɉ" }, { "ɟ" }, { "ʄ" }, { "Ꝃ", "ꝃ" }, { "Ꞣ", "ꞣ" }, { "Ꝁ", "ꝁ" }, { "Ꝅ", "ꝅ" }, { "Ł", "ł" }, { "Ł̣", "ł̣" }, { "Ƚ", "ƚ" }, { "Ꝉ", "ꝉ" }, { "Ⱡ", "ⱡ" }, { "ᴌ" }, { "Ꞥ", "ꞥ" }, { "Ø", "ø" }, { "Ǿ", "ǿ" }, { "Ø̀", "ø̀" }, { "Ø̂", "ø̂" }, { "Ø̃", "ø̃" }, { "Ø̄", "ø̄" }, { "Ø̌", "ø̌" }, { "Ø̨", "ø̨" }, { "Ɵ", "ɵ" }, { "Ɵ́", "ɵ́" }, { "Ɵ̀", "ɵ̀" }, { "Ɵ̂", "ɵ̂" }, { "Ꝋ", "ꝋ" }, { "ᴓ" }, { "ꬾ" }, { "Ᵽ", "ᵽ" }, { "Ꝑ", "ꝑ" }, { "Ꝗ", "ꝗ" }, { "Ꝙ", "ꝙ" }, { "Ɍ", "ɍ" }, { "Ꞧ", "ꞧ" }, { "Ꞩ", "ꞩ" }, { "Ꞩ", "ẜ" }, { "ẝ" }, { "Ⱦ", "ⱦ" }, { "Ŧ", "ŧ" }, { "Ꞹ", "ꞹ" }, { "Ʉ", "ʉ" }, { "Ʉ́", "ʉ́" }, { "Ʉ̀", "ʉ̀" }, { "Ʉ̂", "ʉ̂" }, { "Ʉ̈", "ʉ̈" }, { "Ʉ̃", "ʉ̃" }, { "Ʉ̄", "ʉ̄" }, { "Ʉ̌", "ʉ̌" }, { "Ʉ̃́", "ʉ̃́" }, { "ᵾ" }, { "ꭏ" }, { "Ꝟ", "ꝟ" }, { "Ɏ", "ɏ" }, { "Ƶ", "ƶ" }, { "ꬰ" }, { "Ɖ", "ɖ" }, { "Ð", "ð" }, { "Ð̣", "ð̣" }, { "ƛ" }, { "ƛ̓" }, { "ꬿ" }, { "Ꝥ", "ꝥ" }, { "Ꝧ", "ꝧ" }, { "ᵿ" }, { "Ꜻ", "ꜻ" }, { "ꭁ" }, { "ꭂ" }, { "ꭄ" }, { "ᵺ" }, },
    },
    ["paraphe"] = {
      title = "Lettres à [[paraphe]]",
      entries = { { "Ꞗ", "ꞗ" }, { "Ꝓ", "ꝓ" }, { "Ȿ", "ȿ" }, { "Ɀ", "ɀ" }, },
    },
    ["crampon"] = {
      title = "Lettres [[crampon#fr|cramponées]]",
      entries = { { "Ⱨ", "ⱨ" }, { "Ⱪ", "ⱪ" }, { "Ꞑ", "ꞑ" }, { "Ⱬ", "ⱬ" }, },
    },
    ["crosse"] = {
      title = "Lettres crochues (avec [[crosse]])",
      entries = { { "Ɓ", "ɓ" }, { "Ƈ", "ƈ" }, { "Ɗ", "ɗ" }, { "ᶑ" }, { "Ɠ", "ɠ" }, { "ʛ" }, { "Ɦ", "ɦ" }, { "ʮ" }, { "ʯ" }, { "ʄ" }, { "Ƙ", "ƙ" }, { "Ƥ", "ƥ" }, { "ʠ" }, { "Ƭ", "ƭ" }, { "ꭒ" }, { "ⱱ" }, { "Ʋ", "ʋ" }, { "Ʋ́", "ʋ́" }, { "Ʋ̀", "ʋ̀" }, { "Ʋ̈", "ʋ̈" }, { "Ʋ̃", "ʋ̃" }, { "Ʋ̃́", "ʋ̃́" }, { "Ʋ̃̀", "ʋ̃̀" }, { "Ⱳ", "ⱳ" }, { "Ƴ", "ƴ" }, },
    },
    ["bouclé"] = {
      title = "Lettres [[bouclé#fr|bouclées]] ou à queue [[croisé#fr|croisée]]",
      entries = { { "ɕ" }, { "ȡ" }, { "ꬶ" }, { "Ʝ", "ʝ" }, { "ȴ" }, { "Ɬ", "ɬ" }, { "ꞎ" }, { "ꬺ" }, { "ȵ" }, { "ꬻ" }, { "Ꝍ", "ꝍ" }, { "ꭉ" }, { "ꭊ" }, { "ȶ" }, { "ⱴ" }, { "Ỿ", "ỿ" }, { "ʑ" }, { "ʆ" }, { "ƪ" }, { "ʓ" }, { "ʥ" }, { "ʨ" }, { "ꬼ" }, },
    },
    ["rond inférieur droit"] = {
      title = "Lettres à rond inférieur droit",
      entries = { { "ꭖ" }, { "ꭘ" }, { "ꭔ" }, },
    },
    ["crochet rétroflexe"] = {
      title = "Lettres avec [[hameçon rétroflexe souscrit]]",
      entries = { { "ᶏ" }, { "ᶒ" }, { "ʯ" }, { "ᶖ" }, { "ɭ" }, { "ꞎ" }, { "ɳ" }, { "Ɽ", "ɽ" }, { "ʅ" }, { "Ʂ", "ʂ" }, { "Ʈ", "ʈ" }, { "ᶙ" }, { "ʐ" }, { "ᶐ" }, },
    },
    ["hameçon palatal souscrit"] = {
      title = "Lettres avec [[hameçon palatal souscrit]]",
      entries = { { "ᶀ" }, { "ꞔ" }, { "ᶁ" }, { "ᶂ" }, { "ᶃ" }, { "ᶄ" }, { "ᶅ" }, { "ᶆ" }, { "ᶇ" }, { "ᶈ" }, { "ᶉ" }, { "ᶊ" }, { "ƫ" }, { "ᶌ" }, { "ᶍ" }, { "ᶎ" }, { "𝼘" }, },
    },
    ["hameçon"] = {
      title = "Lettres avec [[hameçon]]",
      entries = { { "Ƒ", "ƒ" }, { "Ꜧ", "ꜧ" }, { "Ɱ", "ɱ" }, { "Ɲ", "ɲ" }, { "Ɋ", "ɋ" }, { "ꭆ" }, { "ƺ" }, },
    },
    ["tilde médian"] = {
      title = "Lettres avec [[tilde médian]]",
      entries = { { "ᵬ" }, { "ᵭ" }, { "ᵮ" }, { "Ɫ", "ɫ" }, { "ꬸ" }, { "ᵯ" }, { "ᵰ" }, { "ᵱ" }, { "ᵲ" }, { "ᵳ" }, { "ᵴ" }, { "ᵵ" }, { "ᵶ" }, },
    },
    ------------------------
    ["potence"] = {
      title = "Lettres à [[potence]]",
      entries = { { "Ƃ", "ƃ" }, { "Ƌ", "ƌ" }, },
    },
    ["culbuté"] = {
      title = "Lettres [[culbuté#fr|culbutées]]",
      entries = { { "Ɐ", "ɐ" }, { "ᵄ" }, { "Ǝ", "ǝ" }, { "ⱻ" }, { "ɟ" }, { "ʄ" }, { "ᵷ" }, { "Ɥ", "ɥ" }, { "ʮ" }, { "ʯ" }, { "ᴉ" }, { "Ʞ", "ʞ" }, { "Ꞁ", "ꞁ" }, { "Ɯ", "ɯ" }, { "Ɯ̃", "ɯ̃" }, { "ꟺ" }, { "ɰ" }, { "ᴟ" }, { "ꟽ" }, { "ᴚ" }, { "Ʇ", "ʇ" }, { "Ʌ", "ʌ" }, { "Ʌ́", "ʌ́" }, { "Ʌ̀", "ʌ̀" }, { "Ʌ̂", "ʌ̂" }, { "Ʌ̈", "ʌ̈" }, { "Ʌ̃", "ʌ̃" }, { "Ʌ̌", "ʌ̌" }, { "Ʌ̲", "ʌ̲" }, { "ʍ" }, { "ʎ" }, { "Ꝿ", "ꝿ" }, { "Ɒ", "ɒ" }, { "ᶛ" }, { "ꭤ" }, { "Ↄ", "ↄ" }, { "Ꜿ", "ꜿ" }, { "ƍ" }, { "ᴈ" }, { "ɞ" }, { "ꭑ" }, { "ʻ" }, { "ᴂ" }, { "ᵆ" }, { "ᴔ" }, { "ꭁ" }, { "ꭂ" }, { "ꭃ" }, { "ꭄ" }, },
    },
    ["réfléchi"] = {
      title = "Lettres [[réfléchi#fr|réfléchies]]",
      entries = { { "ɘ" }, { "ᴎ" }, { "ꟼ" }, { "ᴙ" }, { "ɿ" }, { "ʅ" }, { "ƪ" }, { "Ɜ", "ɜ" }, { "ꭤ" }, { "Ƹ", "ƹ" }, { "ʕ" }, { "ʕ̓" }, { "ꬱ" }, { "ꭀ" }, },
    },
    ["renversé"] = {
      title = "Lettres [[renversé#fr|renversées]]",
      entries = { { "ʁ" }, { "ʖ" }, { "ꭀ" }, },
    },
    ["couché"] = {
      title = "Lettres [[couché#fr|couchées]]",
      entries = { { "ꟷ" }, { "ᴟ" }, { "ᴑ" }, { "ᴓ" }, { "ᴝ" }, { "ᴞ" }, { "ᴒ" }, },
    },
    ["allongé"] = {
      title = "Lettres [[allongé#fr|allongées]] ou [[étiré#fr|étirées]]",
      entries = { { "ʗ" }, { "ꟾ" }, },
    },
    ["empattement inférieur"] = {
      title = "Lettres à empattement inférieur",
      entries = { { "ꭙ" }, { "ꭕ" }, },
    },
    ["long jambage"] = {
      title = "Lettres à long jambage",
      entries = { { "Ƞ", "ƞ" }, { "ꭗ" }, { "ꭘ" }, { "ꭙ" }, },
    },
    ["hampe courte"] = {
      title = "Lettres à [[hampe]] courte",
      entries = { { "ꭎ" }, { "ꭏ" }, { "ꭚ" }, },
    },
    ["gothique"] = {
      title = "Lettres [[gothique#fr|gothiques]]",
      entries = { { "ꬲ" }, { "ꬽ" }, { "ꬾ" }, },
    },
    ["petite capitale"] = {
      title = "[[petite capitale#fr|Petites capitales]]",
      entries = { { "ᴀ" }, { "ʙ" }, { "ᴃ" }, { "ᴄ" }, { "ᴅ" }, { "ᴆ" }, { "ᴇ" }, { "ⱻ" }, { "ꜰ" }, { "ɢ" }, { "ʛ" }, { "ʜ" }, { "Ɪ", "ɪ" }, { "ᵻ" }, { "ᴊ" }, { "ᴋ" }, { "ʟ" }, { "ᴌ" }, { "ᴍ" }, { "ꟺ" }, { "ɴ" }, { "ᴎ" }, { "ᴏ" }, { "ᴐ" }, { "ꭥ" }, { "ᴘ" }, { "ʀ" }, { "ᴙ" }, { "ʁ" }, { "ᴚ" }, { "ꭆ" }, { "ꝶ" }, { "ꜱ" }, { "ᴛ" }, { "ᴜ" }, { "ᵾ" }, { "ᴠ" }, { "ᴡ" }, { "ʏ" }, { "ᴢ" }, { "ᴣ" }, { "ᴁ" }, { "ɶ" }, { "ᴕ" }, },
    },
    ["ligature"] = {
      title = "[[ligature#fr|Ligatures]]",
      entries = { { "Ꜳ", "ꜳ" }, { "Ꜳ́", "ꜳ́" }, { "Ꜳ̈", "ꜳ̈" }, { "Ꜳ̇", "ꜳ̇" }, { "Ꜳ̋", "ꜳ̋" }, { "Ꜳ̣", "ꜳ̣" }, { "Æ", "æ" }, { "Ǽ", "ǽ" }, { "Æ̀", "æ̀" }, { "Æ̂", "æ̂" }, { "Æ̈", "æ̈" }, { "Æ̃", "æ̃" }, { "Ǣ", "ǣ" }, { "Æ̆", "æ̆" }, { "Æ̇", "æ̇" }, { "Æ̊", "æ̊" }, { "Æ̋", "æ̋" }, { "Æ̣", "æ̣" }, { "Æ̨", "æ̨" }, { "Ǽ̨", "ǽ̨" }, { "Ǣ́", "ǣ́" }, { "Ǣ̆", "ǣ̆" }, { "ᴁ" }, { "ᴂ" }, { "ᴭ" }, { "ᵆ" }, { "ꬱ" }, { "Ꜵ", "ꜵ" }, { "Ꜵ́", "ꜵ́" }, { "Ꜵ̋", "ꜵ̋" }, { "Ꜵ̣", "ꜵ̣" }, { "Ꜷ", "ꜷ" }, { "Ꜷ́", "ꜷ́" }, { "Ꜷ̣", "ꜷ̣" }, { "Ꜹ", "ꜹ" }, { "Ꜹ́", "ꜹ́" }, { "Ꜹ̋", "ꜹ̋" }, { "Ꜹ̣", "ꜹ̣" }, { "Ꜹ̨", "ꜹ̨" }, { "Ꜻ", "ꜻ" }, { "Ꜽ", "ꜽ" }, { "Ꜽ̇", "ꜽ̇" }, { "Ꜽ̣", "ꜽ̣" }, { "ȸ" }, { "Ǳ", "ǲ", "ǳ" }, { "ʣ" }, { "Ǆ", "ǅ", "ǆ" }, { "ʤ" }, { "&" }, { "ﬀ" }, { "ﬁ" }, { "ﬂ" }, { "ﬃ" }, { "ﬄ" }, { "ʩ" }, { "Ĳ", "ĳ" }, { "Ǉ", "ǈ", "ǉ" }, { "Ỻ", "ỻ" }, { "ʪ" }, { "ʫ" }, { "ɮ" }, { "Ǌ", "ǋ", "ǌ" }, { "Œ", "œ" }, { "Œ́", "œ́" }, { "Œ̀", "œ̀" }, { "Œ̂", "œ̂" }, { "Œ̈", "œ̈" }, { "Œ̄", "œ̄" }, { "Œ̌", "œ̌" }, { "ɶ" }, { "ꭀ" }, { "ᴔ" }, { "ꭁ" }, { "ꭂ" }, { "ꭢ" }, { "ꭃ" }, { "ꭄ" }, { "Ꝏ", "ꝏ" }, { "Ȣ", "ȣ" }, { "ᴕ" }, { "ȹ" }, { "ẞ", "ß" }, { "ﬆ" }, { "ﬅ" }, { "ʨ" }, { "ᵺ" }, { "ʦ" }, { "ƾ" }, { "Ꜩ", "ꜩ" }, { "ʧ" }, { "ᵫ" }, { "ꭣ" }, { "Ɯ", "ɯ" }, { "Ɯ̃", "ɯ̃" }, { "W", "w" }, { "Ꝡ", "ꝡ" }, },
    },
    ["insulaire"] = {
      title = "Lettres [[insulaire#fr|insulaires]]",
      entries = { { "Ꝺ", "ꝺ" }, { "Ꝺ́", "ꝺ́" }, { "Ꝺ̇", "ꝺ̇" }, { "Ꝼ", "ꝼ" }, { "Ᵹ", "ᵹ" }, { "Ꝿ", "ꝿ" }, { "Ꞃ", "ꞃ" }, { "Ꞅ", "ꞅ" }, { "Ꞇ", "ꞇ" }, },
    },
    ["clic"] = {
      title = "[[clic#fr|Clics]]",
      entries = { { "ǀ" }, { "ǁ" }, { "ǂ" }, { "ǃ" }, { "ʘ" }, },
    },
  }
}

-- Alias
data.diacritics["barre"] = data.diacritics["barré"]
data.diacritics["rayé"] = data.diacritics["barré"]
data.diacritics["diérèse"] = data.diacritics["tréma"]
data.diacritics["étiré"] = data.diacritics["allongé"]

return data
