local data = {
  letters = {
    ["Α"] = {
      diacritics = { { "Ά", "ά" }, { "Ὰ", "ὰ" }, { "Α͂", "ᾶ" }, { "Ᾱ", "ᾱ" }, { "Ᾰ", "ᾰ" }, { "Ἀ", "ἀ" }, { "Ἁ", "ἁ" }, { "ᾼ", "ᾳ" }, { "Άͅ", "ᾴ" }, { "Ὰͅ", "ᾲ" }, { "ᾼ͂", "ᾷ" }, { "Ἄ", "ἄ" }, { "Ἂ", "ἂ" }, { "Ἆ", "ἆ" }, { "ᾈ", "ᾀ" }, { "Ἅ", "ἅ" }, { "Ἃ", "ἃ" }, { "Ἇ", "ἇ" }, { "ᾉ", "ᾁ" }, { "ᾌ", "ᾄ" }, { "ᾊ", "ᾂ" }, { "ᾎ", "ᾆ" }, { "ᾍ", "ᾅ" }, { "ᾋ", "ᾃ" }, { "ᾏ", "ᾇ" }, },
    },
    ["Β"] = {
      variants = { { "ϐ" }, },
    },
    ["Γ"] = {
      diacritics = { { "Γ̇", "γ̇" }, },
      variants = { { "ᴦ" }, },
    },
    ["Δ"] = {
      diacritics = { { "Δ̇", "δ̇" }, },
    },
    ["Ε"] = {
      diacritics = { { "Έ", "έ" }, { "Ὲ", "ὲ" }, { "Ἐ", "ἐ" }, { "Ἑ", "ἑ" }, { "Ε̱", "ε̱" }, { "Ἔ", "ἔ" }, { "Ἒ", "ἒ" }, { "Ἕ", "ἕ" }, { "Ἓ", "ἓ" }, },
      variants = { { "ϵ", "϶" }, },
    },
    ["Ζ"] = {
      diacritics = { { "Ζ̇", "ζ̇" }, },
    },
    ["Η"] = {
      diacritics = { { "Ή", "ή" }, { "Ὴ", "ὴ" }, { "Η͂", "ῆ" }, { "Ἠ", "ἠ" }, { "Ἡ", "ἡ" }, { "ῌ", "ῃ" }, { "Ήͅ", "ῄ" }, { "Ὴͅ", "ῂ" }, { "ῌ͂", "ῇ" }, { "Ἤ", "ἤ" }, { "Ἢ", "ἢ" }, { "Ἦ", "ἦ" }, { "ᾙ", "ᾑ" }, { "Ἥ", "ἥ" }, { "Ἣ", "ἣ" }, { "Ἧ", "ἧ" }, { "ᾘ", "ᾐ" }, { "ᾜ", "ᾔ" }, { "ᾚ", "ᾒ" }, { "ᾞ", "ᾖ" }, { "ᾝ", "ᾕ" }, { "ᾛ", "ᾓ" }, { "ᾟ", "ᾗ" }, },
    },
    ["Θ"] = {
      variants = { { "ϴ", "ϑ" }, },
    },
    ["Ι"] = {
      diacritics = { { "Ί", "ί" }, { "Ὶ", "ὶ" }, { "Ι͂", "ῖ" }, { "Ϊ", "ϊ" }, { "Ῑ", "ῑ" }, { "Ῐ", "ῐ" }, { "Ἰ", "ἰ" }, { "Ἱ", "ἱ" }, { "Ϊ́", "ΐ" }, { "Ϊ̀", "ῒ" }, { "Ϊ͂", "ῗ" }, { "Ἴ", "ἴ" }, { "Ἲ", "ἲ" }, { "Ἶ", "ἶ" }, { "Ἵ", "ἵ" }, { "Ἳ", "ἳ" }, { "Ἷ", "ἷ" }, },
      variants = { { "ͺ" }, { "℩" }, },
    },
    ["Κ"] = {
      diacritics = { { "Κ̇", "κ̇" }, },
      variants = { { "ϰ" }, },
    },
    ["Λ"] = {
      diacritics = { { "Λ̇", "λ̇" }, },
      variants = { { "ᴧ" }, },
    },
    ["Ν"] = {
      diacritics = { { "Ν̇", "ν̇" }, },
    },
    ["Ο"] = {
      diacritics = { { "Ό", "ό" }, { "Ὸ", "ὸ" }, { "Ὀ", "ὀ" }, { "Ὁ", "ὁ" }, { "Ὄ", "ὄ" }, { "Ὂ", "ὂ" }, { "Ὅ", "ὅ" }, { "Ὃ", "ὃ" }, },
    },
    ["Π"] = {
      diacritics = { { "Π̇", "π̇" }, },
      variants = { { "ϖ" }, { "ᴨ" }, },
    },
    ["Ρ"] = {
      diacritics = { { "Ρ̇", "ρ̇" }, { "Ρ̓", "ῤ" }, { "Ῥ", "ῥ" }, },
      variants = { { "ϱ" }, { "ϼ" }, { "ᴩ" }, },
    },
    ["Σ"] = {
      diacritics = { { "Σ̈", "σ̈" }, { "Σ̇", "σ̇" }, },
      variants = { { "Ϲ", "ϲ" }, { "Ͼ", "ͼ" }, { "Ͻ", "ͻ" }, { "Ͽ", "ͽ" }, },
    },
    ["Υ"] = {
      diacritics = { { "Ύ", "ύ" }, { "Ὺ", "ὺ" }, { "Υ͂", "ῦ" }, { "Ϋ", "ϋ" }, { "Ῡ", "ῡ" }, { "Ῠ", "ῠ" }, { "Ϋ́", "ΰ" }, { "Ϋ̀", "ῢ" }, { "Ϋ͂", "ῧ" }, { "Υ̓", "ὐ" }, { "Ὑ", "ὑ" }, { "Υ̓́", "ὔ" }, { "Υ̓̀", "ὒ" }, { "Υ̓͂", "ὖ" }, { "Ὕ", "ὕ" }, { "Ὓ", "ὓ" }, { "Ὗ", "ὗ" }, },
      variants = { { "ϒ" }, { "ϓ" }, { "ϔ" }, },
    },
    ["Φ"] = {
      variants = { { "ϕ" }, },
    },
    ["Χ"] = {
      diacritics = { { "Χ̇", "χ̇" }, },
    },
    ["Ψ"] = {
      variants = { { "ᴪ" }, },
    },
    ["Ω"] = {
      diacritics = { { "Ώ", "ώ" }, { "Ὼ", "ὼ" }, { "Ω͂", "ῶ" }, { "Ὠ", "ὠ" }, { "Ὡ", "ὡ" }, { "ῼ", "ῳ" }, { "Ώͅ", "ῴ" }, { "Ὼͅ", "ῲ" }, { "ῼ͂", "ῷ" }, { "Ὤ", "ὤ" }, { "Ὢ", "ὢ" }, { "Ὦ", "ὦ" }, { "Ὥ", "ὥ" }, { "ᾨ", "ᾠ" }, { "Ὣ", "ὣ" }, { "Ὧ", "ὧ" }, { "ᾩ", "ᾡ" }, { "ᾬ", "ᾤ" }, { "ᾪ", "ᾢ" }, { "ᾮ", "ᾦ" }, { "ᾭ", "ᾥ" }, { "ᾫ", "ᾣ" }, { "ᾯ", "ᾧ" }, },
    },
  },
  diacritics = {
    ["accent"] = {
      title = "Lettres avec [[accent]]",
      entries = { { "Ά", "ά" }, { "Έ", "έ" }, { "Ή", "ή" }, { "Ί", "ί" }, { "Ϊ́", "ΐ" }, { "Ό", "ό" }, { "Ύ", "ύ" }, { "Ϋ́", "ΰ" }, { "Ώ", "ώ" }, },
    },
    ["aigu"] = {
      title = "Lettres avec [[accent aigu]]",
      entries = { { "Ά", "ά" }, { "Άͅ", "ᾴ" }, { "Ἄ", "ἄ" }, { "Ἅ", "ἅ" }, { "ᾌ", "ᾄ" }, { "ᾍ", "ᾅ" }, { "Έ", "έ" }, { "Ἔ", "ἔ" }, { "Ἕ", "ἕ" }, { "Ή", "ή" }, { "Ήͅ", "ῄ" }, { "Ἤ", "ἤ" }, { "Ἥ", "ἥ" }, { "ᾜ", "ᾔ" }, { "ᾝ", "ᾕ" }, { "Ί", "ί" }, { "Ϊ́", "ΐ" }, { "Ἴ", "ἴ" }, { "Ἵ", "ἵ" }, { "Ό", "ό" }, { "Ὅ", "ὅ" }, { "Ὄ", "ὄ" }, { "Ύ", "ύ" }, { "Ϋ́", "ΰ" }, { "Υ̓́", "ὔ" }, { "Ὕ", "ὕ" }, { "ϓ" }, { "Ώ", "ώ" }, { "Ώͅ", "ῴ" }, { "Ὤ", "ὤ" }, { "Ὥ", "ὥ" }, { "ᾭ", "ᾥ" }, { "ᾬ", "ᾤ" }, },
    },
    ["grave"] = {
      title = "Lettres avec [[accent grave]]",
      entries = { { "Ὰ", "ὰ" }, { "Ὰͅ", "ᾲ" }, { "Ἂ", "ἂ" }, { "Ἃ", "ἃ" }, { "ᾊ", "ᾂ" }, { "ᾋ", "ᾃ" }, { "Ὲ", "ὲ" }, { "Ἒ", "ἒ" }, { "Ἓ", "ἓ" }, { "Ὴ", "ὴ" }, { "Ὴͅ", "ῂ" }, { "Ἢ", "ἢ" }, { "Ἣ", "ἣ" }, { "ᾚ", "ᾒ" }, { "ᾛ", "ᾓ" }, { "Ὶ", "ὶ" }, { "Ϊ̀", "ῒ" }, { "Ἲ", "ἲ" }, { "Ἳ", "ἳ" }, { "Ὸ", "ὸ" }, { "Ὂ", "ὂ" }, { "Ὃ", "ὃ" }, { "Ὺ", "ὺ" }, { "Ϋ̀", "ῢ" }, { "Υ̓̀", "ὒ" }, { "Ὓ", "ὓ" }, { "Ὼ", "ὼ" }, { "ᾨ", "ῲ" }, { "Ὢ", "ὢ" }, { "Ὣ", "ὣ" }, { "ᾪ", "ᾢ" }, { "ᾫ", "ᾣ" }, },
    },
    ["circonflexe"] = {
      title = "Lettres avec [[accent circonflexe]]",
      entries = { { "Α͂", "ᾶ" }, { "ᾼ͂", "ᾷ" }, { "Ἆ", "ἆ" }, { "Ἇ", "ἇ" }, { "ᾎ", "ᾆ" }, { "ᾏ", "ᾇ" }, { "Η͂", "ῆ" }, { "ῌ͂", "ῇ" }, { "Ἦ", "ἦ" }, { "Ἧ", "ἧ" }, { "ᾞ", "ᾖ" }, { "ᾟ", "ᾗ" }, { "Ι͂", "ῖ" }, { "Ϊ͂", "ῗ" }, { "Ἶ", "ἶ" }, { "Ἷ", "ἷ" }, { "Υ͂", "ῦ" }, { "Ϋ͂", "ῧ" }, { "Υ̓͂", "ὖ" }, { "Ὗ", "ὗ" }, { "Ω͂", "ῶ" }, { "ῼ͂", "ῷ" }, { "Ὦ", "ὦ" }, { "Ὧ", "ὧ" }, { "ᾮ", "ᾦ" }, { "ᾯ", "ᾧ" }, },
    },
    ["tréma"] = {
      title = "Lettres avec [[tréma]]",
      entries = { { "Ϊ", "ϊ" }, { "Ϊ́", "ΐ" }, { "Ϊ̀", "ῒ" }, { "Ϊ͂", "ῗ" }, { "Σ̈", "σ̈" }, { "Ϋ", "ϋ" }, { "Ϋ́", "ΰ" }, { "Ϋ̀", "ῢ" }, { "Ϋ͂", "ῧ" }, { "ϔ" }, },
    },
    ["macron"] = {
      title = "Lettres avec [[macron]]",
      entries = { { "Ᾱ", "ᾱ" }, { "Ῑ", "ῑ" }, { "Ῡ", "ῡ" }, },
    },
    ["brève"] = {
      title = "Lettres avec [[brève]]",
      entries = { { "Ᾰ", "ᾰ" }, { "Ῐ", "ῐ" }, { "Ῠ", "ῠ" }, },
    },
    ["point en chef"] = {
      title = "Lettres avec [[point en chef]]",
      entries = { { "Γ̇", "γ̇" }, { "Δ̇", "δ̇" }, { "Ζ̇", "ζ̇" }, { "Κ̇", "κ̇" }, { "Λ̇", "λ̇" }, { "Ν̇", "ν̇" }, { "Π̇", "π̇" }, { "Ρ̇", "ρ̇" }, { "Σ̇", "σ̇" }, { "Χ̇", "χ̇" }, },
    },
    ["doux"] = {
      title = "Lettres avec [[esprit doux]]",
      entries = { { "Ἀ", "ἀ" }, { "Ἄ", "ἄ" }, { "Ἂ", "ἂ" }, { "Ἆ", "ἆ" }, { "ᾈ", "ᾀ" }, { "ᾌ", "ᾄ" }, { "ᾊ", "ᾂ" }, { "ᾎ", "ᾆ" }, { "Ἐ", "ἐ" }, { "Ἔ", "ἔ" }, { "Ἒ", "ἒ" }, { "Ἠ", "ἠ" }, { "Ἤ", "ἤ" }, { "Ἢ", "ἢ" }, { "Ἦ", "ἦ" }, { "ᾘ", "ᾐ" }, { "ᾜ", "ᾔ" }, { "ᾚ", "ᾒ" }, { "ᾞ", "ᾖ" }, { "Ἰ", "ἰ" }, { "Ἴ", "ἴ" }, { "Ἲ", "ἲ" }, { "Ἶ", "ἶ" }, { "Ὀ", "ὀ" }, { "Ὄ", "ὄ" }, { "Ὂ", "ὂ" }, { "Ρ̓", "ῤ" }, { "Υ̓", "ὐ" }, { "Υ̓́", "ὔ" }, { "Υ̓̀", "ὒ" }, { "Υ̓͂", "ὖ" }, { "Ὠ", "ὠ" }, { "Ὤ", "ὤ" }, { "Ὢ", "ὢ" }, { "Ὦ", "ὦ" }, { "ᾨ", "ᾠ" }, { "ᾬ", "ᾤ" }, { "ᾪ", "ᾢ" }, { "ᾮ", "ᾦ" }, },
    },
    ["rude"] = {
      title = "Lettres avec [[esprit rude]]",
      entries = { { "Ἁ", "ἁ" }, { "Ἅ", "ἅ" }, { "Ἃ", "ἃ" }, { "Ἇ", "ἇ" }, { "ᾉ", "ᾁ" }, { "ᾍ", "ᾅ" }, { "ᾋ", "ᾃ" }, { "ᾏ", "ᾇ" }, { "Ἑ", "ἑ" }, { "Ἕ", "ἕ" }, { "Ἓ", "ἓ" }, { "Ἡ", "ἡ" }, { "Ἥ", "ἥ" }, { "Ἣ", "ἣ" }, { "Ἧ", "ἧ" }, { "ᾙ", "ᾑ" }, { "ᾝ", "ᾕ" }, { "ᾛ", "ᾓ" }, { "ᾟ", "ᾗ" }, { "Ἱ", "ἱ" }, { "Ἵ", "ἵ" }, { "Ἳ", "ἳ" }, { "Ἷ", "ἷ" }, { "Ὁ", "ὁ" }, { "Ὅ", "ὅ" }, { "Ὃ", "ὃ" }, { "Ῥ", "ῥ" }, { "Ὑ", "ὑ" }, { "Ὕ", "ὕ" }, { "Ὓ", "ὓ" }, { "Ὗ", "ὗ" }, { "Ὡ", "ὡ" }, { "Ὥ", "ὥ" }, { "Ὣ", "ὣ" }, { "Ὧ", "ὧ" }, { "ᾩ", "ᾡ" }, { "ᾭ", "ᾥ" }, { "ᾫ", "ᾣ" }, { "ᾯ", "ᾧ" }, },
    },
    ["iota souscrit"] = {
      title = "Lettres avec [[iota souscrit]]",
      entries = { { "ᾼ", "ᾳ" }, { "Άͅ", "ᾴ" }, { "Ὰͅ", "ᾲ" }, { "ᾼ͂", "ᾷ" }, { "ᾈ", "ᾀ" }, { "ᾉ", "ᾁ" }, { "ᾌ", "ᾄ" }, { "ᾊ", "ᾂ" }, { "ᾎ", "ᾆ" }, { "ᾍ", "ᾅ" }, { "ᾋ", "ᾃ" }, { "ᾏ", "ᾇ" }, { "ῌ", "ῃ" }, { "Ήͅ", "ῄ" }, { "Ὴͅ", "ῂ" }, { "ῌ͂", "ῇ" }, { "ᾙ", "ᾑ" }, { "ᾘ", "ᾐ" }, { "ᾜ", "ᾔ" }, { "ᾚ", "ᾒ" }, { "ᾞ", "ᾖ" }, { "ᾝ", "ᾕ" }, { "ᾛ", "ᾓ" }, { "ᾟ", "ᾗ" }, { "ῼ", "ῳ" }, { "Ώͅ", "ῴ" }, { "ᾨ", "ῲ" }, { "ῼ͂", "ῷ" }, { "ᾨ", "ᾠ" }, { "ᾩ", "ᾡ" }, { "ᾬ", "ᾤ" }, { "ᾪ", "ᾢ" }, { "ᾮ", "ᾦ" }, { "ᾭ", "ᾥ" }, { "ᾫ", "ᾣ" }, { "ᾯ", "ᾧ" }, },
    },
    ["petite capitale"] = {
      title = "[[petite capitale#fr|Petites capitales]]",
      entries = { { "ᴦ" }, { "ᴧ" }, { "ᴨ" }, { "ᴩ" }, { "ᴪ" }, },
    },
  }
}

return data
