local data = {
  ["wide characters"] = { "Ѹ", "Ꚙ", "Ꙭ" },
  ["extensions"] = {
    ["additional"] = {
      ["title"] = "Lettres supplémentaires",
      ["entries"] = { { "Є", "є" }, { "І", "і" }, { "Ђ", "ђ" }, { "Ѕ", "ѕ" }, { "Ј", "ј" }, { "Ћ", "ћ" }, { "Џ", "џ" }, { "Ҽ", "ҽ" }, { "Ә", "ә" }, { "Ӡ", "ӡ" }, { "Ӏ", "ӏ" }, { "Ԛ", "ԛ" }, { "Ԝ", "ԝ" }, { "Һ", "һ" } }
    },
    ["archaic"] = {
      ["title"] = "Lettres archaïques",
      ["entries"] = { { "Ҁ", "ҁ" }, { "Ѻ", "ѻ" }, { "Ѹ", "ѹ" }, { "Ѡ", "ѡ" }, { "Ѿ", "ѿ" }, { "Ѣ", "ѣ" }, { "Ꙗ", "ꙗ" }, { "Ѥ", "ѥ" }, { "Ѧ", "ѧ" }, { "Ѫ", "ѫ" }, { "Ѩ", "ѩ" }, { "Ѭ", "ѭ" }, { "Ѯ", "ѯ" }, { "Ѱ", "ѱ" }, { "Ѳ", "ѳ" }, { "Ѵ", "ѵ" }, { "Ꙟ", "ꙟ" }, { "Ꙉ", "ꙉ" }, { "Ꚃ", "ꚃ" }, { "Ꙁ", "ꙁ" }, { "Ꙃ", "ꙃ" }, { "Ԁ", "ԁ" }, { "Ԅ", "ԅ" }, { "Ԇ", "ԇ" }, { "Ꙇ", "ꙇ" } }
    }
  },
  ["letters"] = {
    ["А"] = {
      ["diacritics"] = { { "А́", "а́" }, { "А̀", "а̀" }, { "А̂", "а̂" }, { "Ӓ", "ӓ" }, { "А̃", "а̃" }, { "А̄", "а̄" }, { "Ӑ", "ӑ" }, { "А̊", "а̊" }, { "А̨", "а̨" }, { "Ӓ̄", "ӓ̄" } },
      ["variants"] = { { "Ӕ", "ӕ" } }
    },
    ["В"] = {
      ["diacritics"] = { { "В̌", "в̌" } },
      ["variants"] = {}
    },
    ["Г"] = {
      ["diacritics"] = { { "Ѓ", "ѓ" }, { "Г̇", "г̇" }, { "Г̌", "г̌" }, { "Г̣", "г̣" }, { "Ғ", "ғ" }, { "Ґ", "ґ" }, { "Ӷ", "ӷ" }, { "Ҕ", "ҕ" }, { "Ғ̌", "ғ̌" }, { "Ӻ", "ӻ" } },
      ["variants"] = { { "Ꙣ", "ꙣ" }, { "Ꙥ", "ꙥ" }, { "Ꙧ", "ꙧ" }, { "Ҥ", "ҥ" } }
    },
    ["Д"] = {
      ["diacritics"] = { { "Д̌", "д̌" }, { "Д̣", "д̣" } },
      ["variants"] = { { "Ꚁ", "ꚁ" }, { "Ꚉ", "ꚉ" }, { "Ꙣ", "ꙣ" } }
    },
    ["Е"] = {
      ["diacritics"] = { { "Е́", "е́" }, { "Ѐ", "ѐ" }, { "Е̂", "е̂" }, { "Ё", "ё" }, { "Е̃", "е̃" }, { "Е̄", "е̄" }, { "Ӗ", "ӗ" }, { "Е̇", "е̇" }, { "Е̨", "е̨" }, { "Ё́", "ё́" }, { "Ё̄", "ё̄" } },
      ["variants"] = { { "Ӕ", "ӕ" }, { "Ԙ", "ԙ" } }
    },
    ["Ё"] = {
      ["diacritics"] = { { "Ё́", "ё́" }, { "Ё̄", "ё̄" } },
      ["variants"] = {}
    },
    ["Ж"] = {
      ["diacritics"] = { { "Ӝ", "ӝ" }, { "Ӂ", "ӂ" }, { "Җ", "җ" } },
      ["variants"] = { { "Ꚅ", "ꚅ" } }
    },
    ["З"] = {
      ["diacritics"] = { { "З́", "з́" }, { "Ӟ", "ӟ" }, { "З̌", "з̌" }, { "З̣", "з̣" }, { "З̱", "з̱" }, { "Ҙ", "ҙ" } },
      ["variants"] = { { "Ԑ", "ԑ" }, { "Ԑ̈", "ԑ̈" }, { "Ꚅ", "ꚅ" } }
    },
    ["И"] = {
      ["diacritics"] = { { "И́", "и́" }, { "Ѝ", "ѝ" }, { "И̂", "и̂" }, { "Ӥ", "ӥ" }, { "И̃", "и̃" }, { "Ӣ", "ӣ" }, { "Й", "й" }, { "Ҋ", "ҋ" } },
      ["variants"] = {}
    },
    ["Й"] = {
      ["diacritics"] = { { "Ҋ", "ҋ" } },
      ["variants"] = {}
    },
    ["К"] = {
      ["diacritics"] = { { "Ќ", "ќ" }, { "К̣", "к̣" }, { "Ԟ", "ԟ" }, { "Ҟ", "ҟ" }, { "Ҝ", "ҝ" }, { "Қ", "қ" }, { "Ҡ", "ҡ" }, { "Ӄ", "ӄ" } },
      ["variants"] = { { "Ԗ", "ԗ" } }
    },
    ["Л"] = {
      ["diacritics"] = { { "Ԯ", "ԯ" }, { "Ӆ", "ӆ" }, { "Ԓ", "ԓ" }, { "Ԡ", "ԡ" } },
      ["variants"] = { { "Ԉ", "ԉ" }, { "Ꙥ", "ꙥ" }, { "Ԕ", "ԕ" }, { "Љ", "љ" } }
    },
    ["М"] = {
      ["diacritics"] = { { "Ӎ", "ӎ" } },
      ["variants"] = { { "Ꙧ", "ꙧ" } }
    },
    ["Н"] = {
      ["diacritics"] = { { "Ң", "ң" }, { "Ӊ", "ӊ" }, { "Ԩ", "ԩ" }, { "Ӈ", "ӈ" }, { "Ԣ", "ԣ" } },
      ["variants"] = { { "Ԋ", "ԋ" }, { "Ҥ", "ҥ" }, { "Њ", "њ" } }
    },
    ["О"] = {
      ["diacritics"] = { { "О́", "о́" }, { "О̀", "о̀" }, { "О̂", "о̂" }, { "Ӧ", "ӧ" }, { "О̃", "о̃" }, { "О̄", "о̄" }, { "О̆", "о̆" }, { "Ө", "ө" }, { "Ӫ", "ӫ" }, { "Ө̄", "ө̄" } },
      ["variants"] = { { "Ю", "ю" }, { "Ҩ", "ҩ" }, { "Ꙩ", "ꙩ" }, { "Ꙫ", "ꙫ" }, { "Ꚙ", "ꚙ" }, { "Ꙭ", "ꙭ" }, { "ꙮ" }, { "Ѻ", "ѻ" } }
    },
    ["П"] = {
      ["diacritics"] = { { "Ԥ", "ԥ" }, { "Ҧ", "ҧ" } },
      ["variants"] = {}
    },
    ["Р"] = {
      ["diacritics"] = { { "Р́", "р́" }, { "Р̌", "р̌" }, { "Ҏ", "ҏ" } },
      ["variants"] = { { "Ԗ", "ԗ" } }
    },
    ["С"] = {
      ["diacritics"] = { { "С́", "с́" }, { "С̈", "с̈" }, { "С̣", "с̣" }, { "С̱", "с̱" }, { "Ҫ", "ҫ" } },
      ["variants"] = {}
    },
    ["Т"] = {
      ["diacritics"] = { { "Т̌", "т̌" }, { "Т̣", "т̣" }, { "Ҭ", "ҭ" }, { "Ꚋ", "ꚋ" } },
      ["variants"] = { { "Ꚍ", "ꚍ" }, { "Ꚑ", "ꚑ" }, { "Ԏ", "ԏ" }, { "Ҵ", "ҵ" }, { "Ꚓ", "ꚓ" } }
    },
    ["У"] = {
      ["diacritics"] = { { "У́", "у́" }, { "У̀", "у̀" }, { "У̂", "у̂" }, { "Ӱ", "ӱ" }, { "У̃", "у̃" }, { "Ӯ", "ӯ" }, { "Ў", "ў" }, { "У̊", "у̊" }, { "У̨", "у̨" }, { "Ӱ́", "ӱ́" } },
      ["variants"] = { { "Ү", "ү" }, { "Ү́", "ү́" }, { "Ұ", "ұ" } }
    },
    ["Х"] = {
      ["diacritics"] = { { "Х̌", "х̌" }, { "Х̑", "х̑" }, { "Х̣", "х̣" }, { "Х̮", "х̮" }, { "Х̱", "х̱" }, { "Ӿ", "ӿ" }, { "Ҳ", "ҳ" }, { "Ӽ", "ӽ" } },
      ["variants"] = { { "Ԕ", "ԕ" }, { "Ԗ", "ԗ" } }
    },
    ["Ц"] = {
      ["diacritics"] = { { "Ꚏ", "ꚏ" } },
      ["variants"] = { { "Ꙡ", "ꙡ" }, { "Ҵ", "ҵ" } }
    },
    ["Ч"] = {
      ["diacritics"] = { { "Ӵ", "ӵ" }, { "Ҷ", "ҷ" }, { "Ҹ", "ҹ" }, { "Ӌ", "ӌ" } },
      ["variants"] = { { "Ꚇ", "ꚇ" }, { "Ꚓ", "ꚓ" } }
    },
    ["Ш"] = {
      ["diacritics"] = { { "Щ", "щ" }, { "Ꚗ", "ꚗ" } },
      ["variants"] = {}
    },
    ["Щ"] = {
      ["diacritics"] = { { "Ꚗ", "ꚗ" } },
      ["variants"] = {}
    },
    ["Ъ"] = {
      ["diacritics"] = { { "Ъ̀", "ъ̀" } },
      ["variants"] = { { "Ꙏ", "ꙏ" }, { "Ꙑ", "ꙑ" } }
    },
    ["Ы"] = {
      ["diacritics"] = { { "Ы́", "ы́" }, { "Ӹ", "ӹ" }, { "Ы̄", "ы̄" }, { "Ы̆", "ы̆" } },
      ["variants"] = {}
    },
    ["Ь"] = {
      ["diacritics"] = { { "Ы́", "ы́" }, { "Ӹ", "ӹ" }, { "Ы̄", "ы̄" }, { "Ы̆", "ы̆" } },
      ["variants"] = { { "Ҍ", "ҍ" }, { "Њ", "њ" } }
    },
    ["Э"] = {
      ["diacritics"] = { { "Э́", "э́" }, { "Э̂", "э̂" }, { "Ӭ", "ӭ" }, { "Э̄", "э̄" }, { "Э̆", "э̆" }, { "Э̇", "э̇" }, { "Э̨", "э̨" } },
      ["variants"] = { { "Ѥ", "ѥ" } }
    },
    ["Ю"] = {
      ["diacritics"] = { { "Ю́", "ю́" }, { "Ю̀", "ю̀" }, { "Ю̂", "ю̂" }, { "Ю̈", "ю̈" }, { "Ю̄", "ю̄" }, { "Ю̆", "ю̆" } },
      ["variants"] = { { "Ꙕ", "ꙕ" } }
    },
    ["Я"] = {
      ["diacritics"] = { { "Я́", "я́" }, { "Я̀", "я̀" }, { "Я̂", "я̂" }, { "Я̈", "я̈" }, { "Я̄", "я̄" }, { "Я̆", "я̆" }, { "Я̨", "я̨" } },
      ["variants"] = { { "Ԙ", "ԙ" } }
    },
    ------------------------
    ["Є"] = {
      ["diacritics"] = { { "Є́", "є́" }, { "Є̈", "є̈" } },
      ["variants"] = {}
    },
    ["Ҽ"] = {
      ["diacritics"] = { { "Ҿ", "ҿ" } },
      ["variants"] = {}
    },
    ["Ә"] = {
      ["diacritics"] = { { "Ә́", "ә́" }, { "Ӛ", "ӛ" }, { "Ә̃", "ә̃" } },
      ["variants"] = {}
    },
    ["Ѕ"] = {
      ["diacritics"] = {},
      ["variants"] = { { "Ꙅ", "ꙅ" } }
    },
    ["І"] = {
      ["diacritics"] = { { "І́", "і́" }, { "І̂", "і̂" }, { "Ї", "ї" }, { "І̨", "і̨" }, { "Ї́", "ї́" } },
      ["variants"] = {}
    },
    ["Ѡ"] = {
      ["diacritics"] = { { "Ѿ", "ѿ" } },
      ["variants"] = { { "Ꙍ", "ꙍ" }, { "Ѽ", "ѽ" } }
    },
    ["Ѹ"] = {
      ["diacritics"] = {},
      ["variants"] = { { "Ꙋ", "ꙋ" } }
    },
    ["Ѵ"] = {
      ["diacritics"] = { { "Ѷ", "ѷ" } },
      ["variants"] = {}
    },
    ["Һ"] = {
      ["diacritics"] = { { "Ԧ", "ԧ" }, { "Ꚕ", "ꚕ" } },
      ["variants"] = {}
    },
    ["Ԁ"] = {
      ["diacritics"] = { { "Ԃ", "ԃ" } },
      ["variants"] = {}
    },
    ["Ѣ"] = {
      ["diacritics"] = { { "Ѣ̈", "ѣ̈" } },
      ["variants"] = { { "Ꙓ", "ꙓ" } }
    },
    ["Ѧ"] = {
      ["diacritics"] = {},
      ["variants"] = { { "Ѩ", "ѩ" }, { "Ꙙ", "ꙙ" }, { "Ꙝ", "ꙝ" } }
    },
    ["Ѫ"] = {
      ["diacritics"] = {},
      ["variants"] = { { "Ѭ", "ѭ" }, { "Ꙛ", "ꙛ" } }
    }
  },
  ["diacritics"] = {
    ["aigu"] = {
      ["title"] = "Lettres avec [[accent aigu]]",
      ["entries"] = { { "А́", "а́" }, { "Ѓ", "ѓ" }, { "Е́", "е́" }, { "Ё́", "ё́" }, { "З́", "з́" }, { "И́", "и́" }, { "Ќ", "ќ" }, { "О́", "о́" }, { "Р́", "р́" }, { "С́", "с́" }, { "У́", "у́" }, { "Ӱ́", "ӱ́" }, { "Ы́", "ы́" }, { "Э́", "э́" }, { "Ю́", "ю́" }, { "Я́", "я́" }, { "Є́", "є́" }, { "Ә́", "ә́" }, { "І́", "і́" }, { "Ї́", "ї́" }, { "Ү́", "ү́" } }
    },
    ["grave"] = {
      ["title"] = "Lettres avec [[accent grave]]",
      ["entries"] = { { "А̀", "а̀" }, { "Ѐ", "ѐ" }, { "Ѝ", "ѝ" }, { "О̀", "о̀" }, { "У̀", "у̀" }, { "Ъ̀", "ъ̀" }, { "Ю̀", "ю̀" }, { "Я̀", "я̀" }, { "Ѷ", "ѷ" } }
    },
    ["circonflexe"] = {
      ["title"] = "Lettres avec [[accent circonflexe]]",
      ["entries"] = { { "А̂", "а̂" }, { "Е̂", "е̂" }, { "И̂", "и̂" }, { "О̂", "о̂" }, { "У̂", "у̂" }, { "Э̂", "э̂" }, { "Ю̂", "ю̂" }, { "Я̂", "я̂" }, { "І̂", "і̂" } }
    },
    ["tréma"] = {
      ["title"] = "Lettres avec [[tréma]]",
      ["entries"] = { { "Ӓ", "ӓ" }, { "Ӓ̄", "ӓ̄" }, { "Ё", "ё" }, { "Ё́", "ё́" }, { "Ё̄", "ё̄" }, { "Ӝ", "ӝ" }, { "Ӟ", "ӟ" }, { "Ԑ̈", "ԑ̈" }, { "Ӥ", "ӥ" }, { "Ӧ", "ӧ" }, { "Ӫ", "ӫ" }, { "С̈", "с̈" }, { "Ӱ", "ӱ" }, { "Ӱ́", "ӱ́" }, { "Ӵ", "ӵ" }, { "Ӹ", "ӹ" }, { "Ӭ", "ӭ" }, { "Ю̈", "ю̈" }, { "Я̈", "я̈" }, { "Є̈", "є̈" }, { "Ӛ", "ӛ" }, { "Ї", "ї" }, { "Ї́", "ї́" }, { "Ѣ̈", "ѣ̈" } }
    },
    ["tilde"] = {
      ["title"] = "Lettres avec [[tilde]]",
      ["entries"] = { { "А̃", "а̃" }, { "Е̃", "е̃" }, { "И̃", "и̃" }, { "О̃", "о̃" }, { "У̃", "у̃" }, { "Ә̃", "ә̃" } }
    },
    ["macron"] = {
      ["title"] = "Lettres avec [[macron]]",
      ["entries"] = { { "А̄", "а̄" }, { "Ӓ̄", "ӓ̄" }, { "Е̄", "е̄" }, { "Ё̄", "ё̄" }, { "Ӣ", "ӣ" }, { "О̄", "о̄" }, { "Ө̄", "ө̄" }, { "Ӯ", "ӯ" }, { "Ы̄", "ы̄" }, { "Э̄", "э̄" }, { "Ю̄", "ю̄" }, { "Я̄", "я̄" } }
    },
    ["brève"] = {
      ["title"] = "Lettres avec [[brève]]",
      ["entries"] = { { "Ӑ", "ӑ" }, { "Ӗ", "ӗ" }, { "Ӂ", "ӂ" }, { "Й", "й" }, { "Ҋ", "ҋ" }, { "О̆", "о̆" }, { "Ў", "ў" }, { "Ы̆", "ы̆" }, { "Э̆", "э̆" }, { "Ю̆", "ю̆" }, { "Я̆", "я̆" } }
    },
    ["point en chef"] = {
      ["title"] = "Lettres avec [[point en chef]]",
      ["entries"] = { { "Г̇", "г̇" }, { "Е̇", "е̇" }, { "Э̇", "э̇" } }
    },
    ["rond en chef"] = {
      ["title"] = "Lettres avec [[rond en chef]]",
      ["entries"] = { { "А̊", "а̊" }, { "У̊", "у̊" } }
    },
    ["caron"] = {
      ["title"] = "Lettres avec [[caron]]",
      ["entries"] = { { "В̌", "в̌" }, { "Г̌", "г̌" }, { "Ғ̌", "ғ̌" }, { "Д̌", "д̌" }, { "З̌", "з̌" }, { "Р̌", "р̌" }, { "Т̌", "т̌" }, { "Х̌", "х̌" } }
    },
    ["brève inversée"] = {
      ["title"] = "Lettres avec [[brève inversée]]",
      ["entries"] = { { "Х̑", "х̑" } }
    },
    ["point souscrit"] = {
      ["title"] = "Lettres avec [[point souscrit]]",
      ["entries"] = { { "Г̣", "г̣" }, { "Д̣", "д̣" }, { "З̣", "з̣" }, { "К̣", "к̣" }, { "С̣", "с̣" }, { "Т̣", "т̣" }, { "Х̣", "х̣" } }
    },
    ["ogonek"] = {
      ["title"] = "Lettres avec [[ogonek]]",
      ["entries"] = { { "А̨", "а̨" }, { "Е̨", "е̨" }, { "У̨", "у̨" }, { "Э̨", "э̨" }, { "Я̨", "я̨" }, { "Ҿ", "ҿ" }, { "І̨", "і̨" } }
    },
    ["brève souscrite"] = {
      ["title"] = "Lettres avec [[brève souscrite]]",
      ["entries"] = { { "Х̮", "х̮" } }
    },
    ["macron souscrit"] = {
      ["title"] = "Lettres avec [[macron souscrit]]",
      ["entries"] = { { "З̱", "з̱" }, { "С̱", "с̱" }, { "Х̱", "х̱" } }
    },
    ------------------------
    ["ligature"] = {
      ["title"] = "[[ligature#fr|Ligatures]] et [[digramme#fr|digrammes]]",
      ["entries"] = { { "Ӕ", "ӕ" }, { "Ꙣ", "ꙣ" }, { "Ꚉ", "ꚉ" }, { "Ꚅ", "ꚅ" }, { "Ꙥ", "ꙥ" }, { "Ԕ", "ԕ" }, { "Љ", "љ" }, { "Ꙧ", "ꙧ" }, { "Ҥ", "ҥ" }, { "Њ", "њ" }, { "Ѹ", "ѹ" }, { "Ꙋ", "ꙋ" }, { "Ԗ", "ԗ" }, { "Ҵ", "ҵ" }, { "Ꚓ", "ꚓ" }, { "Ԙ", "ԙ" } }
    },
    ["barré"] = {
      ["title"] = "Lettres [[barré#fr|barrées]]",
      ["entries"] = { { "Ғ", "ғ" }, { "Ғ̌", "ғ̌" }, { "Ӻ", "ӻ" }, { "Ԟ", "ԟ" }, { "Ҟ", "ҟ" }, { "Ҝ", "ҝ" }, { "Ө", "ө" }, { "Ӫ", "ӫ" }, { "Ө̄", "ө̄" }, { "Ҏ", "ҏ" }, { "Ұ", "ұ" }, { "Ӿ", "ӿ" }, { "Ҹ", "ҹ" } }
    },
    ["hampe"] = {
      ["title"] = "Lettres [[hampe#fr|hampées]]",
      ["entries"] = { { "Ґ", "ґ" } }
    },
    ["crampon"] = {
      ["title"] = "Lettres [[crampon#fr|cramponnées]]",
      ["entries"] = { { "Ӷ", "ӷ" }, { "Җ", "җ" }, { "Ҙ", "ҙ" }, { "Қ", "қ" }, { "Ԯ", "ԯ" }, { "Ң", "ң" }, { "Ԥ", "ԥ" }, { "Ҫ", "ҫ" }, { "Ҭ", "ҭ" }, { "Ҳ", "ҳ" }, { "Ҷ", "ҷ" }, { "Ӌ", "ӌ" }, { "Щ", "щ" }, { "Ԧ", "ԧ" } }
    },
    ["queue"] = {
      ["title"] = "Lettres à [[queue]]",
      ["entries"] = { { "Ҋ", "ҋ" }, { "Ӆ", "ӆ" }, { "Ӎ", "ӎ" }, { "Ӊ", "ӊ" } }
    },
    ["crochet"] = {
      ["title"] = "Lettres avec [[crochet]]",
      ["entries"] = { { "Ӻ", "ӻ" }, { "Ԓ", "ԓ" }, { "Ԩ", "ԩ" }, { "Ӈ", "ӈ" }, { "Ӽ", "ӽ" }, { "Ꚕ", "ꚕ" } }
    },
    ["crochet médian"] = {
      ["title"] = "Lettres avec [[crochet]] [[médian]]",
      ["entries"] = { { "Ҕ", "ҕ" }, { "Ӄ", "ӄ" }, { "Ԡ", "ԡ" }, { "Ԣ", "ԣ" }, { "Ҧ", "ҧ" }, { "Ꚋ", "ꚋ" } }
    },
    ["réfléchi"] = {
      ["title"] = "Lettres avec [[réfléchi#fr|réfléchies]]",
      ["entries"] = { { "Ԑ", "ԑ" }, { "Ԑ̈", "ԑ̈" }, { "Ꙡ", "ꙡ" }, { "Ꙕ", "ꙕ" }, { "Ꙅ", "ꙅ" } }
    },
    ["yodisé"] = {
      ["title"] = "Lettres avec [[yodisé#fr|yodisées]]",
      ["entries"] = { { "Ѥ", "ѥ" }, { "Ꙓ", "ꙓ" }, { "Ѩ", "ѩ" }, { "Ꙝ", "ꙝ" }, { "Ѭ", "ѭ" } }
    }
  }
}

return data
